#include "global.h"
#include "pokemon_summary_screen.h"
#include "data2.h"
#include "ewram.h"
#include "item.h"
#include "items.h"
#include "link.h"
#include "menu.h"
#include "menu_helpers.h"
#include "overworld.h"
#include "palette.h"
#include "party_menu.h"
#include "pokeball.h"
#include "pokemon.h"
#include "region_map.h"
#include "sound.h"
#include "species.h"
#include "sprite.h"
#include "string_util.h"
#include "strings.h"
#include "strings2.h"
#include "task.h"
#include "tv.h"

struct SummaryScreenStruct
{
    /*0x00*/ u8 filler0[9];
    /*0x09*/ u8 unk9;
    /*0x0A*/ u8 fillerA;
    /*0x0B*/ u8 unkB;
    /*0x0C*/ u8 fillerC;
    /*0x0D*/ u8 unkD;
    /*0x0E*/ u8 fillerE[0x2];
    /*0x10*/ struct Pokemon unk10;
    /*0x74*/ u8 filler74;
    /*0x75*/ u8 unk75;
    /*0x76*/ u8 unk76;
    /*0x77*/ u8 filler77[0x2];
    /*0x79*/ u8 unk79;
    /*0x7A*/ u8 unk7A;
    /*0x7B*/ u8 filler7B[0x3];
    /*0x7E*/ u8 unk7E;
    /*0x7F*/ u8 unk7F;
};

#define ewramSS (*(struct SummaryScreenStruct *)(gSharedMem + 0x18000))

extern void sub_80A20A8(u8);
extern u8 ball_number_to_ball_processing_index(u16);
extern void sub_809F678(struct Pokemon *);
extern void sub_80A1BC0(struct Sprite *sprite);
extern void sub_80A1888(struct Sprite *);
extern void sub_80A00F4(s16);
extern void sub_80A0428(struct Pokemon *, s16*);
extern void sub_80A18E4(u8);
extern void GetStringCenterAlignXOffset(u8, u8, u8);
extern u8 *sub_80A1E58(u8 *, u8);
static void sub_80A0A2C(struct Pokemon *, u8, u8);
extern void sub_80A1FF8(const u8 *, u8, u8, u8);

extern TaskFunc gUnknown_03005CF0;
extern const u8 gUnknown_083C15BC[];
extern struct Sprite *gUnknown_020384F4;
extern const u16 gSummaryScreenMonMarkingsPalette[];
extern struct SpriteTemplate gSpriteTemplate_83C1304;
extern struct SpriteTemplate gSpriteTemplate_83C1280;
extern const u8 gUnknown_083C11D8[];
extern struct SpriteTemplate gSpriteTemplate_83C11C0;
