#include "global.h"
#include "asm.h"
#include "battle.h"
#include "main.h"
#include "text.h"
#include "palette.h"
#include "sprite.h"
#include "task.h"
#include "pokemon.h"
#include "species.h"
#include "link.h"
#include "name_string_util.h"
#include "battle_setup.h"
#include "rng.h"
#include "sound.h"
#include "songs.h"
#include "trig.h"
#include "abilities.h"

struct MonCoords
{
    u8 x, y;
};

struct UnknownStruct5
{
    u32 unk0;
    u32 unk4;
    u32 unk8;
};

struct UnknownStruct6
{
    u16 unk0[0xA0];
    u8 fillerA0[0x640];
    u16 unk780[0xA0];
};

struct UnknownStruct7
{
    u8 unk0;
    u8 unk1;
    u8 unk2;
    u8 unk3;
};

struct UnknownStruct8
{
    u8 unk0[7];
    u8 unk7;
    u8 unk8[18];
    u8 unk1A;
};

struct UnknownPokemonStruct2
{
    /*0x00*/ u16 species;
    /*0x02*/ u16 heldItem;
    /*0x04*/ u8 nickname[11];
    /*0x0F*/ u8 level;
    /*0x10*/ u16 hp;
    /*0x12*/ u16 maxhp;
    /*0x14*/ u32 status;
    /*0x18*/ u32 personality;
    /*0x1C*/ u8 gender;
    /*0x1D*/ u8 language;
};

struct UnknownStruct9
{
    u8 unk0;
    u16 unk2;
};

struct UnknownStruct10
{
    u8 unk0_0:1;
    u8 unk0_1:1;
    u8 unk0_2:1;
    u8 filler1[1];
    u8 unk2;
    u8 unk3;
    u8 filler4[8];
};

struct UnknownStruct11
{
    u8 unk0;
    u8 unk1;
    u8 unk2;
    u8 unk3;
    u8 unk4;
    u8 unk5_0:1;
    u8 unk5_1:1;
    u16 unk6;
    u8 unk8[10];
    u8 unk12;
    u8 unk13;
    u8 unk14[10];
    u8 filler1E[2];
    u16 unk20;
    u16 unk22;
    u16 unk24;
    u16 unk26;
    u16 unk28;
    u8 unk2A[10];
    u8 filler34[2];
    u8 unk36[10];
};

struct UnknownStruct12
{
    u32 unk0;
    u8 filler4[0x54];
};

struct UnknownStruct13
{
    u32 unk0_0:1;
    u32 unk0_1:1;
    u32 unk0_2:1;
    u32 unk0_3:1;
    u32 unk0_4:1;
    u32 unk0_5:1;
    u32 unk0_6:1;
    u32 unk0_7:1;
    u32 unk1_0:1;
    u32 unk1_1:1;
    u32 unk1_2:1;
    u32 unk1_3:2;
    u32 unk1_5:1;
    u32 unk1_6:1;
    u32 unk1_7:1;
    u32 unk2_0:1;
    u32 unk2_1:1;
    u32 unk2_2:1;
