#include "global.h"
#include "battle.h"
#include "asm.h"
#include "pokemon.h"
#include "rng.h"

#define AIScriptRead32(ptr) ((ptr)[0] | (ptr)[1] << 8 | (ptr)[2] << 16 | (ptr)[3] << 24)
#define AIScriptRead16(ptr) ((ptr)[0] | (ptr)[1] << 8)
#define AIScriptRead8(ptr) ((ptr)[0])
#define AIScriptReadPtr(ptr) (u8*) AIScriptRead32(ptr)

/* 
this file is a mess. I stopped part way because it starts to involve a huge struct that begins at 0x2000000 and goes
all the way to at least 0x2016800, in addition to extremely hard functions that I can't seem to get right. I am leaving this file
as it currently is until someone bothers to document this huge struct.
*/

extern u16 gBattleTypeFlags;
extern u8 gUnknown_02024A60;
extern u8 gUnknown_02024C07; 
extern u8 gUnknown_02024C08;
extern u8 gUnknown_02024C0C;
extern u16 gUnknown_02024DEC;
extern u8 gUnknown_02024C68;
extern u32 gUnknown_02024BEC;
extern u8 gUnknown_0201601C;
extern u8 gUnknown_0201601F;
extern u16 gUnknown_02024BE6;
extern u8 gCritMultiplier;
extern u16 gUnknown_02024C34[];
extern u32 gUnknown_02024ACC[];
extern u32 gUnknown_02024C98[];
extern u16 gUnknown_02024C7A[];
extern struct BattlePokemon gUnknown_02024A8C[];
extern u8 gUnknown_030042E0[];
extern u8 *gAIScriptPtr;
extern u16 gTrainerBattleOpponent;
extern u32 gBitTable[];
extern u8 *BattleAIs[];
extern struct Trainer gTrainers[];
extern struct BattlePokemon gBattleMons[];
extern struct BattleMove gBattleMoves[];
extern struct BaseStats gBaseStats[];
extern void (*gBattleAICmdTable[])(void);

struct UnknownStruct1
{
/* 0x00 */ u16 unk0[2][8];
/* 0x20 */ u8 unk20[2];
/* 0x22 */ u8 unk22[2];
/* 0x24 */ u16 items[4];
/* 0x2C */ u8 unk8;
};

struct UnknownStruct2 /* 0x2016800 */
{
/* 0x00 */ u8 unk0;
/* 0x01 */ u8 moveConsidered;
/* 0x02 */ u16 unk2;
/* 0x04 */ s8 score[4]; // score?
/* 0x08 */ u32 unk8;
/* 0x0C */ u32 aiFlags;
/* 0x10 */ u8 unk10;
/* 0x11 */ u8 unk11;
/* 0x12 */ u8 filler12[6];
/* 0x18 */ u8 unk18[4];
};

struct UnknownStruct3
{
    u8 filler0[0x20];
    u8 unk20;
};

struct SmallBattleStruct1
{
	u8 unk1;
	u8 unk2;
	u8 unk3;
	u8 unk4;
};

// move to battle.h before PR.
struct BattleStruct /* 0x2000000 */
{
	u8 filler0[0x1601C];
	struct SmallBattleStruct1 unk;
};

extern struct BattleStruct unk_2000000;
extern struct UnknownStruct2 unk_2016800;
extern struct UnknownStruct1 unk_2016A00;
extern struct UnknownStruct3 unk_2016C00;

void sub_810715C(void);
void sub_8107374(void);
void sub_810745C(void);

void sub_81070D4(void)
{
    s32 i;
    u8 *data = (u8 *)&unk_2016A00;
    
    for (i = 0; (u32)i < 48; i++)
        data[i] = 0;

    if ((gBattleTypeFlags & BATTLE_TYPE_TRAINER)
     && gTrainerBattleOpponent != 0x400
     && !(gBattleTypeFlags & (BATTLE_TYPE_LINK | BATTLE_TYPE_SAFARI | BATTLE_TYPE_BATTLE_TOWER | BATTLE_TYPE_EREADER_TRAINER)))
    {
        for (i = 0; i < 4; i++)
        {
            if (gTrainers[gTrainerBattleOpponent].items[i] != 0)
