#include "global.h"
#include "constants/songs.h"
#include "battle_anim.h"
#include "contest.h"
#include "contest_link_80C857C.h"
#include "data2.h"
#include "decompress.h"
#include "ewram.h"
#include "graphics.h"
#include "link.h"
#include "main.h"
#include "menu.h"
#include "menu_cursor.h"
#include "palette.h"
#include "random.h"
#include "sound.h"
#include "sprite.h"
#include "string_util.h"
#include "task.h"
#include "text.h"
#include "unknown_task.h"

extern bool8 AreMovesContestCombo(u16, u16);
extern void sub_80C8A38(u8);
extern void sub_80C8C80(u8);

struct Shared18000
{
    /*0x18000*/ u8 unk18000;
    /*0x18001*/ u8 filler18001[3];
    /*0x18004*/ u16 unk18004[16][16];
    /*0x18204*/ u16 unk18204[0x200];
    /*0x18604*/ u16 unk18604[0x200];
    /*0x18A04*/ u8 unk18A04[0x800];
};

struct Shared19204
{
    /*0x19204*/ u8 unk19204;
    /*0x19205*/ u8 unk19205;
    /*0x19206*/ u8 unk19206[4];
#if 0
    /*0x1920A*/ u16 unk1920A_0:4;
                u16 unk1920A_4:1;
                u16 unk1920A_5:1;
                u16 unk1920A_6:1;
                u16 unk1920A_7:2;
                u16 unk1920B_1:1;
                u16 unk1920B_2:1;
#else
    /*0x1920A*/ u8 unk1920A;
    /*0x1920B*/ u8 unk1920B;
#endif
    /*0x1920C*/ u8 unk1920C;
    /*0x1920D*/ u8 filler1920D[0x14-0xD];
    /*0x19214*/ u8 unk19214;
    /*0x19215*/ u8 unk19215;
    /*0x19216*/ u8 unk19216;
    /*0x19217*/ s8 unk19217;
    /*0x19218*/ u8 unk19218[4];
    /*0x1921C*/ u32 unk1921C;
                u8 filler19220[0x5D-0x20];
    /*0x1925D*/ u8 unk1925D;
    /*0x1925E*/ u8 unk1925E;
    /*0x1925F*/ u8 filler1925F;
};

struct UnknownContestStruct1
{
    u8 filler0[2];
    u16 unk2;  // s16?
    u8 filler4[2];
    u16 unk6;  // move
    u16 unk8;
    u8 unkA;   // contest category
    u8 unkB_0:2;
    u8 unkB_2:1;
    u8 unkB_3:4;
    u8 unkB_7:1;
    u8 unkC_0:1;
    u8 unkC_1:1;
    u8 unkC_2:1;
    u8 fillerD;
    u8 unkE;
    u8 fillerF;
    u8 unk10;  // maybe a bitfield
    u8 unk11;
    u8 filler12;
    u8 unk13;
    u8 unk14;
    u8 unk15;
    u8 unk16;
    u8 unk17;
    u8 unk18;
    u8 unk19;
    u8 filler1A[0x1C-0x1A];
};

struct UnknownContestStruct3
{
    u8 filler0[2];
    //u8 unk2_0:1;
    //u8 unk2_1:1;
    u8 unk2;  // maybe a bitfield
    u8 filler3;
};

// possibly the same as UnknownContestStruct3?
struct UnknownContestStruct4
{
    u8 filler0[2];
    u8 unk2;  // maybe a bitfield
    u8 filler3;
};

struct UnknownContestStruct5
{
    u16 bits_0:8;
    u16 bits_8:1;
    u16 bits_9:3;
    s8 unk2;
    u8 filler3;
};

struct Shared19260
{
    /*0x19260*/ struct UnknownContestStruct1 unk19260[4];
    /*0x192D0*/ u8 unk192D0[0x14];
    /*0x192E4*/ u8 unk192E4[0x44];
    ///*0x19328*/ u8 unk19328[4];
    /*0x19328*/ struct UnknownContestStruct5 unk19328;
    /*0x1932C*/ u8 filler1932C[0x38-0x2C];
    /*0x19338*/ struct UnknownContestStruct4 unk19338[4];
    /*0x19348*/ struct UnknownContestStruct3 unk19348[5];
};

#define shared15800 (gSharedMem + 0x15800)
#define shared18000 (*(struct Shared18000 *)(gSharedMem + 0x18000))
#define shared19204 (*(struct Shared19204 *)(gSharedMem + 0x19204))
#define shared19260 (*(struct Shared19260 *)(gSharedMem + 0x19260))

extern u8 gBattleMonForms[];
extern u8 gDisplayedStringBattle[];
extern u16 gBattleTypeFlags;
extern u8 gBankAttacker;
extern u8 gBankTarget;
extern u8 gBanksBySide[];
extern u8 gObjectBankIDs[];
extern u8 gIsLinkContest;
extern u8 gContestPlayerMonIndex;
extern u16 gUnknown_030041B0;
extern s16 gUnknown_030041B4;
extern u16 gUnknown_030041B8;
extern u16 gUnknown_03004200;
extern struct Window gUnknown_03004210;
extern u16 gUnknown_03004240;
extern u16 gUnknown_03004244;
extern u16 gUnknown_03004280;
extern u16 gUnknown_03004288;
extern u16 gUnknown_030042A0;
extern u16 gUnknown_030042A4;
extern u16 gUnknown_030042C0;
extern u16 gUnknown_030042C4;
extern u32 gUnknown_03005D28;
