#include "global.h"
#include "main.h"
#include "pokenav.h"
#include "battle.h"
#include "data2.h"
#include "de_rom_8040FE0.h"
#include "overworld.h"
#include "string_util.h"
#include "palette.h"
#include "task.h"
#include "unknown_task.h"
#include "sound.h"
#include "region_map.h"
#include "songs.h"
#include "flags.h"

extern u8 ewram[];

struct UnknownPokenav0 {
	/* 0x0000 */ u8 var0[0x0300];
	/* 0x0300 */ void (*var300)(void);
	/* 0x0304 */ u16 var304;
	/* 0x0306 */ u16 var306;
	/* 0x0308 */ u32 var308;
	/* 0x030C */ u8 fill030C[0x6a9f];
	/* 0x6dab */ u8 var6dab;
	/* 0x6dac */ u8 var6dac;
	/* 0x6dad */ u8 var6dad;
	/* 0x6dae */ u8 var6dae;
	/* 0x6daf */ u8 fill6daf[0x3];
	/* 0x6db2 */ u8 var6db2[5];
	/* 0x6db7 */ u8 fill6db7[0x25];
	/* 0x6ddc */ s8 var6ddc;
	/* 0x6ddd */ u8 fill6ddd[0x13];
	/* 0x6df0 */ s8 var6df0;
	/* 0x6df1 */ u8 fill6df1[0xB];
	/* 0x6dfc */ u8 var6dfc;
	/* 0x6dfd */ u8 fill6dfd[0x17];
	/* 0x6e14 */ u8 var6e14;
	/* 0x6e15 */ u8 var6e15;
	/* 0x6e16 */ u8 var6e16;
	/* 0x6e17 */ u8 var6e17;
	/* 0x6e18 */ u8 fill6e18[0x78];
	/* 0x6e90 */ u8 var6e90;
	/* 0x6e91 */ u8 fill6e91[0x4];
	/* 0x6e95 */ u8 var6e95;
	/* 0x6e96 */ u8 var6e96[0x814];
	/* 0x76AA */ u8 var76aa;
	/* 0x76AB */ u8 fill76AB[0x10BD];
	/* 0x8768 */ u32 var8768;
	/* 0x876C */ u8 fill876C[0x2];
	/* 0x876E */ u8 var876E;
	/* 0x876F */ u8 fill876F[0x5];
	/* 0x8774 */ s16 var8774;
	/* 0x8776 */ u8 fill8776[0x55];
	/* 0x87CB */ u8 var87CB;
	/* 0x87CC */ u8 fill87CC[0xC];
	/* 0x87D8 */ u8 var87D8;
	/* 0x87D9 */ u8 fill87D9[0x1];
	/* 0x87DA */ s16 var87DA;
	/* 0x87DC */ s16 var87DC;
	/* 0x87DE */ u8 fill87DE[0x4a];
	/* 0x8828 */ u8 playerPartyCount;
	/* 0x8829 */ u8 fill8829[0x07bf];
	/* 0x8FE8 */ s8 var8fe8;
	/* 0x8FE9 */ u8 fill8FE9[0x16];
	/* 0x8FFF */ u8 var8fff[5];
	/* 0x9004 */ u8 fill9004[0x340];
	/* 0x9344 */ u8 var9344;
	/* 0x9345 */ u8 fill9345[0x3b8b];
	/* 0xced0 */ u32 varCED0;
	/* 0xced4 */ u8 fillCED4[0x284];
	/* 0xD158 */ u16 varD158;
	/* 0xD15A */ u8 fillD15A[0x8];
	/* 0xD162 */ u8 varD162;
};

#define ewram0 (*(struct UnknownPokenav0*)(ewram + 0))

struct UnknownPokenav0_1 {
	u8 fill6dad[0x6dad];
	s8 var6dad;
	s8 var6dae;
};

#define ewram0_1 (*(struct UnknownPokenav0_1*)(ewram + 0))

IWRAM_DATA void (*gUnknown_03000744)(void);

extern const u8 gPokenavHoennMapMisc_Gfx[];
extern const u8 gUnknown_08E99FB0[];
extern const u16 gPokenavHoennMap1_Pal[];

static void sub_80EBCA8();
static void sub_80EEE20();
static bool8 sub_80EEE54();
static void sub_80EEE08();
static void sub_80EED2C(u8);
static void sub_80EC268();
static void sub_80EED1C();
static void sub_80EE9C0(u8, u8, u8);
static bool8 sub_80EEA0C();
static bool8 sub_80EEC10();
static void sub_80EED9C();
static void sub_80EDB88();
static void sub_80EC4A0();
static void sub_80EC81C();
static void sub_80EE96C();
static void sub_80EE3D8();
static bool8 sub_80EEF34();
static void sub_80EED0C();
static void sub_80EC67C();
static void sub_80EC86C();
static bool8 sub_80EEC90();
