#include "global.h"
#include "name_string_util.h"
#include "string_util.h"
#include "text.h"
#include "main.h"
#include "species.h"
#include "items.h"
#include "moves.h"
#include "easy_chat.h"
#include "link.h"
#include "strings2.h"
#include "graphics.h"
#include "palette.h"
#include "task.h"
#include "menu.h"
#include "text_window.h"
#include "pokemon_icon.h"
#include "cable_club.h"
#include "party_menu.h"
#include "songs.h"
#include "sound.h"
#include "data2.h"
#include "trade.h"

#ifdef ENGLISH
#define sub_804A96C_alt sub_804A96C
#endif

struct InGameTrade {
    /*0x00*/ u8 name[11];
    /*0x0C*/ u16 species;
    /*0x0E*/ u8 ivs[6];
    /*0x14*/ bool8 secondAbility;
    /*0x18*/ u32 otId;
    /*0x1C*/ u8 stats[5];
    /*0x24*/ u32 personality;
    /*0x28*/ u16 heldItem;
    /*0x2A*/ u8 mailNum;
    /*0x2B*/ u8 otName[11];
    /*0x36*/ u8 otGender;
    /*0x37*/ u8 sheen;
    /*0x38*/ u16 playerSpecies;
};

struct UnkStructC {
    /*0x00*/ u16 words[9];
    /*0x10*/ u8 string[8];
    /*0x1A*/ u8 otId[4];
    /*0x1E*/ u16 species;
    /*0x20*/ u16 heldItem;
};

struct UnkStructD {
    /*0x00*/ u8 pad00[0x10];
    /*0x10*/ u8 var10;
    /*0x11*/ u8 pad11[1];
    /*0x12*/ u16 var12[1];
};

struct UnkStructE {
    /*0x00*/ u8 filler_00[8];
    /*0x08*/ void *vramAddr;
    /*0x0c*/ u8 filler_0c[4];
    /*0x10*/ u8 unk_10;
    /*0x12*/ u16 unk_12[0x400];
};

struct TradeEwramSubstruct {
    /*0x0000*/ u8 unk_0000;
    /*0x0001*/ u8 unk_0001;
    /*0x0004*/ struct Window window;
    /*0x0034*/ u8 playerPartyIcons[6];
    /*0x003a*/ u8 friendPartyIcons[6];
    /*0x0040*/ u8 unk_0040;
    /*0x0041*/ u8 tradeMenuCursorPosition;
    /*0x0042*/ u8 playerPartyCount;
    /*0x0043*/ u8 friendPartyCount;
    /*0x0044*/ u8 tradeMenuOptionsActive[13];
    /*0x0051*/ u8 filler_0051[0x24];
    /*0x0075*/ u8 unk_0075;
    /*0x0076*/ u8 filler_0076[4];
    /*0x007a*/ u8 unk_007a;
    /*0x007b*/ u8 unk_007b;
    /*0x007c*/ u8 unk_007c;
    /*0x007d*/ u8 unk_007d;
    /*0x007e*/ u16 unk_007e;
    /*0x0080*/ u8 unk_0080;
    /*0x0081*/ u8 unk_0081;
    /*0x0082*/ u8 filler_0082[2];
    /*0x0084*/ u8 unk_0084;
    /*0x0085*/ u8 unk_0085;
    /*0x0086*/ u8 unk_0086;
    /*0x0087*/ u8 unk_0087;
    /*0x0088*/ u8 filler_0088[2];
    /*0x008a*/ u8 unk_008a;
    /*0x008b*/ u8 unk_008b;
    /*0x008c*/ u16 linkData[20];
    /*0x00b4*/ u8 unk_00b4;
    /*0x00b5*/ u8 unk_00b5[7];
    /*0x00bc*/ u8 filler_00bc[12];
    /*0x00c8*/ struct UnkStructE unk_00c8;
    /*0x08dc*/ u8 filler_04dc[0x724];
};

struct UnkStructF {
    u8 filler_0000[9];
    u8 unk_0009;
    u8 filler_000a[0xff6];
};

struct TradeEwramStruct {
    /*0x00000*/ u8 filler_00000[0x7000];
    /*0x07000*/ struct TradeEwramSubstruct unk_07000;
    /*0x08000*/ struct UnkStructF unk_08000;
    /*0x09000*/ u8 filler_09000[0x4000];
    /*0x0d000*/ u8 tileBuffers[13][256];
};

static void sub_8047EC0(void);
/*static*/ void sub_804AFB8(const struct WindowConfig *, u8 *, const u8 *, u8);
/*static*/ void sub_804ACD8(const u8 *, u8 *, u8);
static void nullsub_5(u8, u8);
/*static*/ void sub_804AA88(void);
/*static*/ void sub_804A964(struct UnkStructE *, void *);
static void sub_80489F4(void);
/*static*/ void sub_804AA0C(u8);
static bool8 sub_8048D44(void);
/*static*/ void sub_804AF84(void);
/*static*/ bool8 sub_804ABF8(void);
/*static*/ void sub_804ACF4(u8);
/*static*/ void sub_804A41C(u8);
static void sub_8048C70(void);
static void sub_8048B0C(u8);
/*static*/ void sub_804AE3C(u8);
/*static*/ void sub_804AF10(void);
static void sub_80494D8(void);
static void sub_8048AB4(void);
/*static*/ void sub_804A940(struct UnkStructE *);
/*static*/ void sub_804B41C(void);
/*static*/ void sub_8049DE0(void);
/*static*/ void sub_804AB30(void);
/*static*/ void sub_8049ED4(u8);
/*static*/ void sub_804A6DC(u8);
