#include "global.h"
#include "name_string_util.h"
#include "string_util.h"
#include "text.h"
#include "main.h"
#include "species.h"
#include "items.h"
#include "moves.h"
#include "easy_chat.h"
#include "link.h"
#include "strings2.h"
#include "graphics.h"
#include "palette.h"
#include "task.h"
#include "menu.h"
#include "text_window.h"
#include "pokemon_icon.h"
#include "cable_club.h"
#include "party_menu.h"
#include "songs.h"
#include "sound.h"
#include "data2.h"
#include "pokemon_summary_screen.h"
#include "rom4.h"
#include "rom_8077ABC.h"
#include "daycare.h"
#include "event_data.h"
#include "strings.h"
#include "load_save.h"
#include "save.h"
#include "script.h"
#include "field_fadetransition.h"
#include "decompress.h"
#include "mail_data.h"
#include "evolution_scene.h"
#include "pokeball.h"
#include "pokedex.h"
#include "trade.h"

#ifdef ENGLISH
#define sub_804A96C_alt sub_804A96C
asm(".set sub_804A96C_alt, sub_804A96C");
#endif

#define Trade_SendData(ptr) (SendBlock(bitmask_all_link_players_but_self(), ptr->linkData, 20))

struct InGameTrade {
    /*0x00*/ u8 name[11];
    /*0x0C*/ u16 species;
    /*0x0E*/ u8 ivs[6];
    /*0x14*/ bool8 secondAbility;
    /*0x18*/ u32 otId;
    /*0x1C*/ u8 stats[5];
    /*0x24*/ u32 personality;
    /*0x28*/ u16 heldItem;
    /*0x2A*/ u8 mailNum;
    /*0x2B*/ u8 otName[11];
    /*0x36*/ u8 otGender;
    /*0x37*/ u8 sheen;
    /*0x38*/ u16 playerSpecies;
};

struct UnkStructC {
    /*0x00*/ u16 words[9];
    /*0x10*/ u8 string[8];
    /*0x1A*/ u8 otId[4];
    /*0x1E*/ u16 species;
    /*0x20*/ u16 heldItem;
};

struct UnkStructD {
    /*0x00*/ u8 filler_00[8];
    /*0x08*/ void *vramAddr;
    /*0x0c*/ u8 filler_0c[4];
    /*0x10*/ u8 unk_10;
    /*0x12*/ u16 unk_12[0x400];
};

struct UnkStructE {
    /*0x00*/ u8 unk_00;
    /*0x02*/ u16 unk_02;
    /*0x04*/ u8 unk_04;
};

struct TradeEwramSubstruct {
    /*0x0000*/ u8 unk_0000;
    /*0x0001*/ u8 unk_0001;
    /*0x0004*/ struct Window window;
    /*0x0034*/ u8 partyIcons[2][6];
    /*0x0040*/ u8 tradeMenuCursorSpriteIdx;
    /*0x0041*/ u8 tradeMenuCursorPosition;
    /*0x0042*/ u8 partyCounts[2];
    /*0x0044*/ u8 tradeMenuOptionsActive[13];
    /*0x0051*/ u8 unk_0051[6];
    /*0x0057*/ u8 filler_0057[6];
    /*0x005d*/ u8 unk_005d[4][6];
    /*0x0075*/ u8 unk_0075;
    /*0x0076*/ u8 filler_0076[4];
    /*0x007a*/ u8 unk_007a;
    /*0x007b*/ u8 unk_007b;
    /*0x007c*/ u8 unk_007c;
    /*0x007d*/ u8 unk_007d;
    /*0x007e*/ u16 unk_007e;
    /*0x0080*/ u8 unk_0080[2];
    /*0x0082*/ u8 unk_0082[2];
    /*0x0084*/ u8 unk_0084;
    /*0x0085*/ u8 unk_0085;
    /*0x0086*/ u8 unk_0086;
    /*0x0087*/ u8 unk_0087;
    /*0x0088*/ u8 filler_0088[2];
    /*0x008a*/ u8 unk_008a;
    /*0x008b*/ u8 unk_008b;
    /*0x008c*/ u16 linkData[20];
    /*0x00b4*/ u8 unk_00b4;
    /*0x00b5*/ u8 unk_00b5[11];
    /*0x00c0*/ u8 filler_00c0[8];
    /*0x00c8*/ struct UnkStructD unk_00c8;
    /*0x08dc*/ struct UnkStructE unk_08dc[4];
    /*0x08fc*/ u8 filler_08fc[0x704];
};

struct UnkStructF {
    u8 filler_0000[9];
    u8 unk_0009;
    u8 filler_000a[0xff6];
};

struct TradeEwramSubstruct2 {
    /*0x0000*/ u8 filler_0000;
    /*0x0004*/ struct Window window;
    /*0x0034*/ u8 textWindowBaseTileNum;
    /*0x0038*/ struct Pokemon pokemon;
    /*0x009c*/ u8 unk_009c;
    /*0x009d*/ u8 unk_009d;
    /*0x009e*/ u16 linkData[12];
    /*0x00b6*/ u16 unk_00b6;
    // Sprite indices
    /*0x00b8*/ u8 unk_00b8;
    /*0x00b9*/ u8 unk_00b9;
    /*0x00ba*/ u8 unk_00ba;
    /*0x00bb*/ u8 unk_00bb;
    /*0x00bc*/ u8 unk_00bc;
    /*0x00bd*/ u8 unk_00bd;
    // Timer
    /*0x00c0*/ u32 unk_00c0;
    // Scene index
    /*0x00c4*/ u16 unk_00c4;
    /*0x00c6*/ u8 filler_00c6[0x3c];
    /*0x0102*/ u8 unk_0102;
    /*0x0103*/ u8 unk_0103;
    /*0x0104*/ u16 unk_0104;
    /*0x0106*/ u16 unk_0106;
    /*0x0108*/ u16 unk_0108;
    /*0x010a*/ u16 unk_010a;
    /*0x010c*/ u16 unk_010c;
    /*0x010e*/ s16 unk_010e;
    /*0x0110*/ s16 unk_0110;
    /*0x0112*/ u16 unk_0112;
    /*0x0114*/ u16 unk_0114;
    /*0x0116*/ s16 unk_0116;
    /*0x0118*/ u16 unk_0118;
    /*0x011a*/ u16 unk_011a;
    /*0x011c*/ u16 unk_011c;
    /*0x011e*/ u8 isLinkTrade;
    /*0x0120*/ u16 unk_0120;
    /*0x0122*/ u16 unk_0122;
    /*0x0124*/ u16 unk_0124;
};

struct TradeEwramStruct {
    /*0x00000*/ u8 filler_00000[0x7000];
    /*0x07000*/ struct TradeEwramSubstruct unk_07000;
    /*0x08000*/ struct UnkStructF unk_08000;
    /*0x09000*/ u8 filler_09000[0x4000];
    /*0x0d000*/ u8 tileBuffers[13][256];
    /*0x0dd00*/ u8 filler_0dd00[0x1300];
    /*0x0f000*/ struct TradeEwramSubstruct2 unk_0f000;
};

static void sub_8047EC0(void);
/*static*/ void sub_804AFB8(const struct WindowConfig *, u8 *, const u8 *, u8);
/*static*/ void sub_804ACD8(const u8 *, u8 *, u8);
static void nullsub_5(u8, u8);
static void sub_804AA88(void);
static void sub_804A964(struct UnkStructD *, void *);
static void sub_80489F4(void);
/*static*/ void sub_804AA0C(u8);
static bool8 sub_8048D44(void);
/*static*/ void sub_804AF84(void);
static bool8 sub_804ABF8(void);
/*static*/ void sub_804ACF4(u8);
static void sub_804A41C(u8);
static void sub_8048C70(void);
static void sub_8048B0C(u8);
/*static*/ void sub_804AE3C(u8);
/*static*/ void sub_804AF10(void);
static void sub_80494D8(void);
static void sub_8048AB4(void);
static void sub_804A940(struct UnkStructD *);
/*static*/ void sub_804B41C(void);
static void sub_8049DE0(void);
static void sub_804AB30(void);
static void sub_8049ED4(u8);
static void sub_804A6DC(u8);
static void sub_804A938(struct UnkStructD *);
