#include "global.h"
#include "trainer_card.h"
#include "asm.h"
#include "event_data.h"
#include "link.h"
#include "main.h"
#include "menu.h"
#include "money.h"
#include "palette.h"
#include "pokedex.h"
#include "rom4.h"
#include "songs.h"
#include "sound.h"
#include "sprite.h"
#include "string_util.h"
#include "task.h"

typedef void (*Callback)(void);

struct Struct2000000
{
    /*0x00*/ u8 var_0;
    /*0x01*/ bool8 var_1;
    /*0x02*/ u8 var_2;
    /*0x03*/ bool8 var_3;
    /*0x04*/ u8 var_4;
    /*0x05*/ u8 var_5;
    /*0x06*/ u8 var_6;
    /*0x07*/ bool8 var_7;
    /*0x08*/ bool8 var_8;
    /*0x09*/ bool8 var_9;
    /*0x0A*/ bool8 var_a;
    /*0x0B*/ bool8 var_b;
    /*0x0C*/ bool8 var_c;
    /*0x0D*/ bool8 var_d;
    /*0x0E*/ u8 var_e[8];
    /*0x16*/ u8 filler_16[10];
    /*0x20*/ u8 var_20[4][0x10];
    /*0x60*/ Callback *var_60;
    /*0x64*/ struct TrainerCard var_64;
    /*0x9C*/ u8 language; // 0x9C
};

extern struct Struct2000000 unk_2000000;
extern struct LinkPlayerMapObject gLinkPlayerMapObjects[];
extern struct TrainerCard gTrainerCards[4];

extern u8 gUnknown_03004DE0[]; // TODO: find out correct type

extern u8 gUnknown_083B5EF4[];
extern u16 *gUnknown_083B5EF8[5];
extern u16 gUnknown_083B5F0C[];
extern u16 gBadgesPalette[];
extern u16 gUnknown_083B5F4C[];

extern u16 gUnknown_08E8CFC0[];
extern u16 gUnknown_08E8D9C0[];

extern u8 gOtherText_TrainersTrainerCard[];
extern u8 gOtherText_FirstHOF[];
extern u8 gOtherText_LinkCableBattles[];
extern u8 gOtherText_BattleTowerWinRecord[];
extern u8 gOtherText_ContestRecord[];
extern u8 gOtherText_MixingRecord[];
extern u8 gOtherText_TradeRecord[];
extern u8 gOtherText_Boy[];
extern u8 gOtherText_Girl[];

// Other signature than on save_menu_util.h
void FormatPlayTime(u8 *playtime, u16 hours, u16 minutes, s16 colon);

u16 GetPokedexSeenCount(void);

enum
{
    TD_0,
    TD_1,
    TD_CALLBACK,
};

