#include "global.h"
#include "trainer_card.h"
#include "easy_chat.h"
#include "event_data.h"
#include "field_effect.h"
#include "graphics.h"
#include "link.h"
#include "main.h"
#include "menu.h"
#include "money.h"
#include "palette.h"
#include "pokedex.h"
#include "rom4.h"
#include "script_pokemon_80C4.h"
#include "songs.h"
#include "sound.h"
#include "sprite.h"
#include "string_util.h"
#include "strings2.h"
#include "task.h"
#include "unknown_task.h"
#include "util.h"

typedef void (*Callback)(void);

struct Struct2000000
{
    /*0x00*/ u8 var_0;
    /*0x01*/ bool8 var_1;
    /*0x02*/ u8 var_2;
    /*0x03*/ bool8 var_3;
    /*0x04*/ u8 var_4;
    /*0x05*/ u8 var_5;
    /*0x06*/ u8 var_6;
    /*0x07*/ bool8 var_7;
    /*0x08*/ bool8 var_8;
    /*0x09*/ bool8 var_9;
    /*0x0A*/ bool8 var_a;
    /*0x0B*/ bool8 var_b;
    /*0x0C*/ bool8 var_c;
    /*0x0D*/ bool8 var_d;
    /*0x0E*/ u8 var_e[8];
    /*0x16*/ u8 filler_16[10];
    /*0x20*/ u8 var_20[4][0x10];
    /*0x60*/ Callback *var_60;
    /*0x64*/ struct TrainerCard var_64;
    /*0x9C*/ u8 language; // 0x9C
};

extern u8 ewram[];
#define ewram0 (*(struct Struct2000000 *)(ewram))

extern struct LinkPlayerMapObject gLinkPlayerMapObjects[];

EWRAM_DATA struct TrainerCard gTrainerCards[4] = {0};

struct UnknownStruct1
{
    u16 filler0[0x3C0];
    u16 unk780[160];
};
extern struct UnknownStruct1 gUnknown_03004DE0;

extern const u8 gBadgesTiles[];
extern const u16 gUnknown_083B5F0C[];
extern const u16 gBadgesPalette[];
extern const u16 gUnknown_083B5F4C[];
extern const u16 gUnknown_083B5F6C[];
extern const u16 gUnknown_083B5F8C[][4];

const u8 gBadgesTiles[] = INCBIN_U8("graphics/trainer_card/badges.4bpp");
// XXX: what is this?
u8 *const ewram_ = ewram;

bool8 sub_8093864(struct Task *);
bool8 sub_80938A8(struct Task *);
bool8 sub_80938CC(struct Task *);
bool8 sub_8093918(struct Task *);
bool8 sub_8093938(struct Task *);
bool8 sub_8093954(struct Task *);
bool8 sub_8093980(struct Task *);

bool8 (*const gUnknown_083B5EBC[])(struct Task *) =
{
    sub_8093864,
