#include "global.h"
#include "trainer_card.h"
#include "constants/songs.h"
#include "contest_util.h"
#include "easy_chat.h"
#include "event_data.h"
#include "ewram.h"
#include "field_effect.h"
#include "graphics.h"
#include "link.h"
#include "m4a.h"
#include "main.h"
#include "menu.h"
#include "money.h"
#include "overworld.h"
#include "palette.h"
#include "pokedex.h"
#include "scanline_effect.h"
#include "sound.h"
#include "sprite.h"
#include "string_util.h"
#include "strings2.h"
#include "task.h"
#include "util.h"

typedef void (*Callback)(void);

struct Struct2000000
{
    /*0x00*/ u8 current_state;
    /*0x01*/ bool8 isShowingLinkCard;
    /*0x02*/ u8 starCount;
    /*0x03*/ bool8 backSideShown;
    /*0x04*/ u8 var_4;
    /*0x05*/ bool8 showColon;
    /*0x06*/ u8 frameCounter; /* Used to flash colon */
    /*0x07*/ bool8 showPokedexCount;
    /*0x08*/ bool8 showHallOfFame;
    /*0x09*/ bool8 showLinkBattleStatus;
    /*0x0A*/ bool8 showBattleTowerStatus;
    /*0x0B*/ bool8 showContestRecord;
    /*0x0C*/ bool8 showMixingRecord;
    /*0x0D*/ bool8 showTradingRecord;
    /*0x0E*/ bool8 ownedBadges[8];
    /*0x16*/ u8 filler_16[10];
    /*0x20*/ u8 easyChatPhrase[4][0x10];
    /*0x60*/ Callback *var_60;
    /*0x64*/ struct TrainerCard displayedCard;
    /*0x9C*/ u8 language; // 0x9C
};

extern struct LinkPlayerObjectEvent gLinkPlayerObjectEvents[];

EWRAM_DATA struct TrainerCard gTrainerCards[4] = {0};

extern const u16 gUnknown_083B5F0C[];
extern const u16 gBadgesPalette[];
extern const u16 gUnknown_083B5F4C[];
extern const u16 gUnknown_083B5F6C[];
extern const u16 gTrainerCardBadgesMap[][4];

const u8 gBadgesTiles[] = INCBIN_U8("graphics/trainer_card/badges.4bpp");

struct Struct2000000 * const gTrainerCardPtr = (struct Struct2000000 *)gSharedMem;

#if DEBUG
const struct TrainerCard sTestTrainerCard =
{
    .gender = FEMALE,
    .stars = 4,
    .hasPokedex = TRUE,
    .var_3 = TRUE,
    .var_4 = TRUE,
    .firstHallOfFameA = 999,
    .firstHallOfFameB = 99,
    .firstHallOfFameC = 99,
    .pokedexSeen = 411,
    .trainerId = 12345,
    .playTimeHours = 99,
    .playTimeMinutes = 99,
    .linkBattleWins = 9999,
    .linkBattleLosses = 9999,
    .battleTowerWins = 9999,
    .battleTowerLosses = 9999,
