//========================================================================================
//										コイン
//								2002/03/29 by nakahiro
//========================================================================================
#ifndef	_COIN_H
#define _COIN_H


#define	MY_COIN_MAX		9999	// 手持ちコインの最大数
#define	COIN_KETA_MAX	4

//---------------------------------------
//		ウィンドウ内の所持金表示
//	引数：my  = 所持コイン
//		  x,y = ウィンドウ左上座標
//---------------------------------------
extern void DrawWinCoin( u32 my, u8 x, u8 y );

//---------------------------------------
//		所持コインウィンドウ表示
//	引数：my  = 所持コイン
//		  x,y = ウィンドウ左上座標
//---------------------------------------
extern void DrawCoinWin( u32 my, u8 x, u8 y );

//---------------------------------------
//		所持コインウィンドウ削除
//	引数：x,y = ウィンドウ左上座標
//---------------------------------------
extern void DelCoinWin( u8 x, u8 y );

//---------------------------------------
//				コイン表示
//	引数：my   = コイン数
//		  keta = 表示桁数
//		  x,y  = ウィンドウ左上座標
//---------------------------------------
extern void DrawCoin( u32 my, u8 keta, u8 x, u8 y );

//---------------------------------------
//			手持ち枚数チェック
//	戻り値 : 手持ちコイン数
//---------------------------------------
extern u16 G_CheckCoin(void);

//---------------------------------------
//			手持ちに加える
//	引数   : u16 coin = 調べる枚数
//	戻り値 : TRUE = 成功　FALSE = 失敗
//---------------------------------------
extern u8 G_AddCoin( u16 coin );

//---------------------------------------
//			手持ちを減らす
//	引数   : u16 coin = 調べる枚数
//	戻り値 : TRUE = 成功　FALSE = 失敗
//---------------------------------------
extern u8 G_SubCoin( u16 coin );


#endif	 /*_COIN_H*/
