/********************************************************************/
/*                      con_pic.c                                   */
/*                    コンテストの絵表示                            */
/*                       by tomo                                    */
/********************************************************************/

#define CON_MES_MAX	(60+2)			//Max60(1行30文字*2)文字＋改行(or終了)2文字分
									//コンテスト＆美術館兼用

/*==================================================================*/
/*==================================================================*/
#define CON_MES_NO_MAX 5			//コンテストメッセージの種類

#define CON_TYPE_NAME_LEN	(5+1+1)	//コンテスト名＋空白(","代わり)+Endコード

#define CON_MES_X	7				//メッセージ表示位置(コンテスト)Ｘ
#define CON_MES_Y	14				//メッセージ表示位置(コンテスト)Ｘ
/*==================================================================*/
/*==================================================================*/
#define MUS_MES_NO_MAX 15			//美術館メッセージの種類

#define MUS_MES_X	5				//メッセージ表示位置(美術館)Ｘ
#define MUS_MES_Y	14				//メッセージ表示位置(美術館)Ｘ
/*==================================================================*/
/*==================================================================*/
#define TEMP_PAL_AREA	(0x18000-512)			//パレット計算用テンポラリイ
#define TEMP_BG_AREA	(0x18000-512-0x2000)	//ＢＧ計算用テンポラリイ

/*==================================================================*/
/*==================================================================*/
#define POKE_X1	((240-64)/2)		//ポケモンOBJＸ座標
#define POKE_Y1	(24)				//ポケモンOBJＹ座標
#define POKE_X2	((240-64)/2)		//ポケモンOBJＸ座標
#define POKE_Y2	(24)				//ポケモンOBJＹ座標

/*==================================================================*/
/*==================================================================*/
#define BG_CB_NO		0			//Character Block
#define BG_SB_NO		12			//Map(Screen) Block

#define PIC_EFF_CHAR_BASE_ADDR		(BG_VRAM+BG_CB_NO*0x4000)			//コンテストBGを置くCBアドレス
#define PIC_EFF_SCREEN_BASE_ADDR	(BG_VRAM+BG_SB_NO*0x0800)			//コンテストBGを置くSBアドレス
/*==================================================================*/
/*==================================================================*/
#define MES_CB_NO		1			//Character Block
#define MES_SB_NO		10			//Map(Screen) Block

/*==================================================================*/
/*==================================================================*/
#define MOS_BAI			2			//モザイク時のカウント1:通常～3:３倍遅い
#define MOS_MAX			15			//モザイク最大拡大(15が最大)

/*==================================================================*/
/*==================================================================*/
#define DUMMY_PIC_X		7		//ダミーとして額縁内の部分だけ取り出した画像(元は美術館用画像)
#define DUMMY_PIC_Y		3		//ダミーとして額縁内の部分だけ取り出した画像
#define DUMMY_PIC_W		16		//ダミーとして額縁内の部分だけ取り出した画像
#define DUMMY_PIC_H		8		//ダミーとして額縁内の部分だけ取り出した画像

#define DUMMY_WHITE_CHAR	0x1015			//白系のダミー背景（キャラ番号0x15,パレット番号1）
/*==================================================================*/
/*==================================================================*/
