#ifndef __ENCOUNT_H__
#define __ENCOUNT_H__

//=========================================================================
//	
//=========================================================================

#undef GLOBAL
#ifdef __ENCOUNT_H_GLOBAL__
#define GLOBAL /*	*/
#else
#define GLOBAL extern
#endif

//=========================================================================
//	定義
//=========================================================================
//#define name value

//typedef ...


//=========================================================================
//	変数
//=========================================================================
//GLOBAL type valiable;


//=========================================================================
//	関数プロトタイプ
//=========================================================================
//------------------------------------------
//	通常エンカウント開始
//------------------------------------------
GLOBAL void StartWildEncountEvent( void );

//------------------------------------------
//	移動ポケモンエンカウント開始
//------------------------------------------
GLOBAL void StartMvPokeEncountEvent( void );

//------------------------------------------
//	トレーナーエンカウント開始
//------------------------------------------
GLOBAL void StartTrainerEncountEvent( void );

//------------------------------------------
//	捕獲デモ開始
//	※スクリプトからプログラム呼び出しで起動
//------------------------------------------
GLOBAL void StartCaptureDemoEncountEvent( void );

//------------------------------------------
//	スクリプトからの野生ポケモン戦呼び出し
//------------------------------------------
GLOBAL void StartScriptEncountEvent( void );

//------------------------------------------
//	特別なポケモンとの戦闘呼び出し
//	※エンカウントＭＳＧが違う
//------------------------------------------
GLOBAL void StartSpPokeEncountEvent( void );

//------------------------------------------
//	古代ポケモンとの戦闘呼び出し
//	※エンカウントＭＳＧ＆戦闘背景＆ＢＧＭが違う
//------------------------------------------
GLOBAL void StartKodaiPokeEncountEvent( void );


//------------------------------------------
//	点字ポケモンとの戦闘呼び出し
//	※エンカウントＭＳＧ＆ＢＧＭが違う
//------------------------------------------
GLOBAL void StartTenjiPokeEncountEvent( void );


//------------------------------------------
//	戦闘時の地形タイプを取得する
//	<戻り値>	地形タイプ（fight.hで定義)
//------------------------------------------
GLOBAL u8 GetFightGroundType( void );

//------------------------------------------
//エンカウントエフェクトタイプ取得
//※バトルタワーなど特殊トレーナー用
//<戻り値>	エフェクト指定（ec_eff.hで定義）
//------------------------------------------
GLOBAL u8 GetSpTrainerEncountEffect(void);

//------------------------------------------
// 最初の３体のポケモン選択へ遷移
//------------------------------------------
GLOBAL void PokeSelEventStart( void );

#undef GLOBAL
#endif	/*__ENCOUNT_H__*/

