//=========================================================================
//
//	フィールドイベントで起動される補助プログラム
//	
//	2001	GAME FREAK Inc.
//	2001.10.25	by tama
//=========================================================================

#ifndef EV_SUB_H
#define EV_SUB_H
#undef GLOBAL
#ifdef EV_SUB_H_GLOBAL
#define GLOBAL /*	*/
#else
#define GLOBAL extern
#endif

//=========================================================================
//	定義
//=========================================================================
//#define name value

//天候制御関連指定
#define NON_FORCE_CTRL			0		/* 制御をスクリプトで指定 */

#define SHINE_CTRL				1		/*天候制御	晴れ*/
#define SHINE2_CTRL				2		/*天候制御	晴れ(雲なし）*/
#define RAIN_CTRL				3		/*天候制御	雨*/
#define	SNOW_CTRL				4		/*天候制御	雪*/
#define	THUNDER_CTRL			5		/*天候制御	かみなり*/
#define MIST_CTRL				6		/*天候制御	霧1*/
#define MIST2_CTRL				7		/*天候制御	霧2*/
#define ASH_CTRL				8		/*天候制御	火山灰*/
#define STORM_CTRL				9		/*天候制御	砂嵐*/
#define CLOUD_CTRL				10		/*天候制御	くもり*/
#define SHINE3_CTRL				11		/*天候制御	晴れ3 */

#define	SRTR_CTRL				20		/*天候制御	日数変化１ */
#define	SSRS_CTRL				21		/*天候制御	日数変化２ */


//エフェクト制御関連指定
#define	MAP_EFFECT_NOTHING		0		/*エフェクト制御　なし */
#define	MAP_EFFECT_ASH			1		/*エフェクト制御　灰 */
#define MAP_EFFECT_BRIDGE		2		/*エフェクト制御　つり橋 */
#define	MAP_EFFECT_LOG			3		/*エフェクト制御　丸太 */
#define MAP_EFFECT_ICETRAP		4		/*エフェクト制御　ルネジムトラップ */
#define MAP_EFFECT_CARGO		5		/*エフェクト制御　トラック内 */
#define MAP_EFFECT_BASE			6		/*エフェクト制御　秘密基地 */
#define MAP_EFFECT_BREAKFLOOR	7		/*エフェクト制御　壊れる床 */


#define	SP_MUS_ROAD118		0x7fff		/*特別BGMコード */


//typedef ...


//=========================================================================
//	変数
//=========================================================================
//GLOBAL type valiable;


//=========================================================================
//	関数プロトタイプ
//=========================================================================
//GLOBAL type function(arg...);

#ifndef ASM_CPP	/* アセンブラでないときのみ有効 */

//-------------------------------------------------------------
//	POSイベントによるプログラム呼び出し
//-------------------------------------------------------------
GLOBAL void EventPosProgramCall( u8 id );

//-------------------------------------------------------------
//	灰エフェクトの制御タスクセット
//-------------------------------------------------------------
GLOBAL void AddFieldAshEffectTask(void);


//-------------------------------------------------------------
//	マップ固有エフェクト制御の初期化
//-------------------------------------------------------------
GLOBAL void InitMapEffectControl( void );

//-------------------------------------------------------------
//	マップ固有エフェクトのマップ切り替えによる更新
//-------------------------------------------------------------
GLOBAL void UpdateMapEffectControl( void );

//-------------------------------------------------------------
//	マップ固有エフェクト制御のID設定
//	<引数>	id		マップ固有エフェクトのID
//-------------------------------------------------------------
GLOBAL void SetMapEffectControl( u8 id );

#endif

#undef GLOBAL
#endif	/*EV_SUB_H*/

