
//=========================================================================
//	
//=========================================================================

#ifndef FCONTEXT_H
#define FCONTEXT_H
#undef GLOBAL
#ifdef FCONTEXT_H_GLOBAL
#define GLOBAL /*	*/
#else
#define GLOBAL extern
#endif

//=========================================================================
//	定義
//=========================================================================
//#define name value
//typedef ...

//	文字表示ＢＧ制御構造体
struct FONT_CONTEXT_STRUCT{
		u8 BGNum;				//使用するＢＧのナンバー
		u8 CGXBlockNum;			//使用するキャラのブロック指定
		u8 SCRBlockNum;			//使用するスクリーンのブロック指定
		u8 BGpriority;			//使用するＢＧの表示優先順位
		u8 BasePalette;			//基本使用パレット
		u8 BaseFontColor;		//基本文字カラー
		u8 BaseBGColor;			//基本背景カラー
		u8 BaseShadowColor;		//基本影カラー
		u8 BaseFontType;		//基本フォント
		u8 UseMode;				//文字表示モード
		u32	CGXadrs;			//使用するキャラのアドレス
		u32	SCRadrs;			//使用するスクリーンのアドレス
		u16 * Screen;			//仮想ＶＲＡＭのアドレス（未実装）
};
typedef struct FONT_CONTEXT_STRUCT FONT_CONTEXT;


//	文字表示モード定義
enum{
		TRANSFONTMODE,		/* 転送フォントモード */
		FIXFONTMODE,		/* 常駐フォントモード */
		TRANSCGXMODE,		/* データ転送モード */
		FIXSCRNMODE,		/* 転送型、スクリーン固定モード */
};


//=========================================================================
//	変数
//=========================================================================
//GLOBAL type valiable;


//=========================================================================
//	関数プロトタイプ
//=========================================================================
//GLOBAL type function(arg...);

//-------------------------------------------------------------------------
//	コンテキスト指定ＩＤからコンテキストへのポインタを取得
//-------------------------------------------------------------------------
GLOBAL CONST_FONT_CONTEXT_P GetFontContext(CONTEXT_TYPE type);

//-------------------------------------------------------------------------
// MSG制御構造体からコンテキストデータを取得
//-------------------------------------------------------------------------
GLOBAL u8 * MsgContextGetCGXadrs( TALK_WIN * tw );
GLOBAL u16 * MsgContextGetSCRadrs( TALK_WIN * tw );

#undef GLOBAL
#endif	/*FCONTEXT_H*/

