//=========================================================================
//	
//=========================================================================

#ifndef FLD_TALK_H
#define FLD_TALK_H
#undef GLOBAL
#ifdef FLD_TALK_H_GLOBAL
#define GLOBAL /*	*/
#else
#define GLOBAL extern
#endif

//=========================================================================
//	定義
//=========================================================================
//#define name value

//typedef ...
enum{
		FLDMSG_STAT_OFF,
		FLDMSG_STAT_ON,
		FLDMSG_STAT_NORMAL,
		FLDMSG_STAT_NOSKIP,
};

//=========================================================================
//	変数
//=========================================================================
//GLOBAL type valiable;


//=========================================================================
//	関数プロトタイプ
//=========================================================================
//GLOBAL type function(arg...);

//-------------------------------------------------------------------------
//	初期化処理
//-------------------------------------------------------------------------
GLOBAL void FieldMsgInit(void);

//-------------------------------------------------------------------------
//　メッセージ表示のセット
//-------------------------------------------------------------------------
GLOBAL u8 FieldMsgSet(const u8 * msg_adrs);
GLOBAL u8 FieldMsgSetNoSkip(const u8 * msg_adrs);
GLOBAL u8 FieldMsgSetForce( const u8 * msg_adrs ); // 強制セット(デバッグ用）

//-------------------------------------------------------------------------
//	メッセージの終了待ち
//	<戻り値>
//	TRUE	MSG表示終了
//	FALSE	MSG表示中
//-------------------------------------------------------------------------
GLOBAL u8 FieldMsgWait(void);

//-------------------------------------------------------------------------
//	フィールドメッセージウィンドウのクリア(終了処理用）
//-------------------------------------------------------------------------
GLOBAL void FieldMsgClear( void );

//-------------------------------------------------------------------------
// メッセージの状態を返す
//-------------------------------------------------------------------------
GLOBAL u8 FieldMsgStatusCheck(void);

//-------------------------------------------------------------------------
//	フィールドメッセージをキャンセル
//	※ウィンドウ内を消去
//-------------------------------------------------------------------------
GLOBAL void FieldMsgCancel(void);

//-------------------------------------------------------------------------
//	会話開始制御
//-------------------------------------------------------------------------
GLOBAL void AddTalkStartTask( void );
GLOBAL void AddTalkObjStartTask( void );
GLOBAL u8 EvWaitTalkObjStart( void );
GLOBAL u8 EvWaitTalkStart( void );

GLOBAL void TalkEnd( void );
GLOBAL void TalkObjEnd( void );

#undef GLOBAL
#endif	/*FLD_TALK_H*/

