
//=========================================================================
//	
//=========================================================================

#ifndef FLD_TASK_H
#define FLD_TASK_H

#include "field.h"

#undef GLOBAL
#ifdef FLD_TASK_H_GLOBAL
#define GLOBAL /*	*/
#else
#define GLOBAL extern
#endif

//=========================================================================
//	定義
//=========================================================================

enum{
		TSK_PRI_SYSTEM = 1,
		TSK_PRI_CONTROL = 10,
		TSK_PRI_EFFECT = 80,
};

//=========================================================================
//	変数
//=========================================================================
//GLOBAL type valiable;

//フィールドの明るさ段階最大値
//実際に指定できる値は 0～FIELD_BRIGHT_MAX
extern const int FIELD_BRIGHT_MAX;

//=========================================================================
//	関数プロトタイプ
//=========================================================================

//-------------------------------------------------------------
//	現在のマップと前のマップのタイプからフェードインをセット
//-------------------------------------------------------------
GLOBAL void FieldFadeInSet( void );

//-------------------------------------------------------------
//	黒からのフェードインをセット
//	※転送問題の解消のためPaletteWorkTransを直接初期化している
//-------------------------------------------------------------
GLOBAL void FieldFadeBlackInSet( void );

//-------------------------------------------------------------
//	現在のマップと次のマップのタイプからフェードアウトをセット
//-------------------------------------------------------------
GLOBAL void FieldFadeOutSet( void );

//-------------------------------------------------------------
// フィールド出現演出用のタスクセット
//-------------------------------------------------------------
GLOBAL void AddFieldInTask(void);
GLOBAL void AddFieldBlackInTask( void );

//-------------------------------------------------------------
// ワープ後の出現演出用のタスクセット
//-------------------------------------------------------------
GLOBAL void AddFieldInWarpTask(void);

//-------------------------------------------------------------
// フィールド出現演出用のタスクセット(フェード後スクリプト実行再開）
//-------------------------------------------------------------
// BGM開始を呼ばない
GLOBAL void AddScriptFieldInTask(void);
// BGM開始を呼ぶ（同じBGMの場合はそのまま継続する）
GLOBAL void AddScriptFieldInBGMNotStartTask(void);

//-------------------------------------------------------------
//　フィールド出現タスクセット（通信部屋の場合）
//-------------------------------------------------------------
GLOBAL void AddCommFieldStartTask(void);
GLOBAL void AddCommFieldInTask(void);

//-------------------------------------------------------------
// マップ遷移タスクセット（通信部屋の場合）
//-------------------------------------------------------------
GLOBAL void AddCommMapChangeTask( void );

//-------------------------------------------------------------
//	マップ遷移タスクセット（通信部屋から終了して出る場合）
//-------------------------------------------------------------
GLOBAL void AddCommEndMapChangeTask( void );

//-------------------------------------------------------------
// マップ遷移の移行コントロール用タスクセット
//-------------------------------------------------------------
GLOBAL void AddMapChangeTask(void);
GLOBAL void AddMapChangeSeNotTask(void);
GLOBAL void AddDoorMapChangeTask( void );

//-------------------------------------------------------------
// 落とし穴落下移行コントロール用タスクセット
//-------------------------------------------------------------
GLOBAL void AddMapChangeFallTask( void );

//-------------------------------------------------------------
// ｴｽｶﾚｰﾀ移動遷移ｺﾝﾄﾛｰﾙ用ﾀｽｸｾｯﾄ
//-------------------------------------------------------------
GLOBAL void AddMapChangeEscalatorTask( u8 );

//-------------------------------------------------------------
//	間欠泉ｺﾝﾄﾛｰﾙﾀｽｸｾｯﾄ
//-------------------------------------------------------------
GLOBAL void AddMapChangeGayserTask( void );

//-------------------------------------------------------------
//	隠し穴ｺﾝﾄﾛｰﾙﾀｽｸｾｯﾄ
//-------------------------------------------------------------
GLOBAL void AddMapChangeHidePitFallTask( void );

//-------------------------------------------------------------
// ワープ後のコントロール用タスクセット
//-------------------------------------------------------------
GLOBAL void AddMapChangeWarpTask( void );

//-------------------------------------------------------------
//	高速船デモモードへ遷移するコントロールタスクセット
//-------------------------------------------------------------
GLOBAL void AddMapChangeShipTask( void );

//-------------------------------------------------------------
// デバッグ用マップ切り替えタスクのセット
//-------------------------------------------------------------
GLOBAL void AddDebugMapChangeTask(void);

//-------------------------------------------------------------
//	フィールドメニュー復帰用タスクセット
//-------------------------------------------------------------
GLOBAL void AddFieldMenuInTask(void);

//-------------------------------------------------------------
//	フィールド復帰→イベント終了タスクセット
//-------------------------------------------------------------
GLOBAL void AddFieldEventEndFadeInTask(void);

//-------------------------------------------------------------
//	フィールド復帰→イベント終了タスクセット
//-------------------------------------------------------------
GLOBAL void AddFieldEncountEndFadeInTask(void);

//-------------------------------------------------------------
// マップ遷移のタスクセット：通信コンテスト用
//-------------------------------------------------------------
GLOBAL void AddContestMapChangeTask(void);


GLOBAL u8 AddFieldFadeInTask(void);			// フェードイン
GLOBAL u8 AddFieldFadeOutTask(void);		// フェードアウト

//-------------------------------------------------------------
//	視界変更演出セット
//-------------------------------------------------------------
//視界変更エフェクト開始
GLOBAL void StartFieldLasterChange( u8 next );
//フィールド初期化時データ設定
GLOBAL void MakeFieldLasterData( u8 r );

#undef GLOBAL
#endif	/*FLD_TASK_H*/

