
#ifndef __FLD_MENU_H__
#define __FLD_MENU_H__

//=========================================================================
//	
//=========================================================================

#include "task.h"

#undef GLOBAL
#ifdef __FLD_MENU_H_GLOBAL__
#define GLOBAL /*	*/
#else
#define GLOBAL extern
#endif

//=========================================================================
//	定義
//=========================================================================
//#define name value

//typedef ...


//=========================================================================
//	変数
//=========================================================================
//GLOBAL type valiable;

extern u8 (*MenuFunc)();					//メニュー制御関数ポインタ

extern u8 fieldPick;						//選択中メニュー番号
extern u8 fieldMax;							//ウィンドウ表示行数
extern u8 fieldMenuList[];					//メニューリストバッファ


//=========================================================================
//	関数プロトタイプ
//=========================================================================
//GLOBAL type function(arg...);

//-----------------------------------------
//		デバッグ用メニューフラグセット
//-----------------------------------------
GLOBAL void DebugMenuFlagSet(void);

//-----------------------------------------
//	メニュー生成→メニュータスクに制御を渡す
//-----------------------------------------
GLOBAL void StartFieldMenuEvent(void);

//-----------------------------------------
//	フィールドメニュー生成後、指定タスクに制御を渡す
//	<引数>	ret		タスク関数アドレス
//-----------------------------------------
GLOBAL void FieldMenuInitTaskSet( pTaskFunc ret );

//-----------------------------------------
//	フィールドメニュー制御タスク
//-----------------------------------------
GLOBAL void FieldMenuFuncTask(u8 no);



#undef GLOBAL
#endif	/*__FLD_MENU_H__*/

