//=========================================================================================
//									秘密基地・グッズを戻す
//						base_gds.c を分割	2002/02/07 by nakahiro
//=========================================================================================

//=========================================================================================
//									プロトタイプ宣言
//=========================================================================================
extern void GoodsGetInit(u8);					// 初期設定
extern void DelGoods(u8);						// グッズを箱に戻す
extern void ObjGoodsReturn(void);

extern void Set_GDS_CursorPal(void);			// カーソルパレット
extern void Del_GDS_CursorPal(void);			// カーソルパレット
