//========================================================================================
//									手持ちグッズ関連
//									2002/06/18 by nakahiro
//========================================================================================
#ifndef	_GOODS_H
#define _GOODS_H

typedef struct {
	u8 * box;		// 保存場所
	const u8 max;	// 最大数
}GOODS_BOX;

extern const GOODS_BOX goods_box[];

typedef struct {
	u8 * id;		// 配置したグッズのID
	u8 * pos;		// 配置したグッズのPos
	u8   max;		// 配置できるグッズのMax
	u8   type;		// 模様替え処理タイプ
}FURNITURE_POS;

#define	FURNITURE	( (FURNITURE_POS *)&UserWork[0x1f000] )

enum {
	BASE_GOODS_TYPE = 0,
	MY_ROOM_GOODS_TYPE,
};

//--------------------------------
//		場所ごとに初期化
//	引数   : u8 id = グッズの種類
//--------------------------------
extern void GoodsBoxInit( u8 id );

//--------------------------------
//			初期化
//--------------------------------
extern void GoodsAllInit(void);

//--------------------------------
//			空きを調べる
//	引数   : u8 id = グッズの種類
//	戻り値 : s8 i  = 場所
//			 -1    = 空き無し
//--------------------------------
extern s8 CheckGoodsSpace( u8 id );

//------------------------------------
//		指定グッズをもっているか
//	引数   : u8 id = グッズ番号
//	戻り値 : TRUE  = あり
//			 FALSE = なし
//------------------------------------
extern u8 CheckGoodsMine( u8 id );

//----------------------------------
//			手持ちに加える
//	引数   : u8 no = グッズ番号
//	戻り値 : TRUE  = 成功
//			 FALSE = 失敗
//----------------------------------
extern u8 AddGoods( u8 no );

//----------------------------------
//			手持ちに加えられるかチェック
//			※02/07/14追加（@Tomomichi Ohta@)
//	引数   : u8 no = グッズ番号
//	戻り値 : TRUE  = 成功
//			 FALSE = 失敗
//----------------------------------
extern u8 AddGoodsCheck( u8 no );

//----------------------------------
//			手持ちから減らす
//	引数   : u8 no = グッズ番号
//	戻り値 : TRUE  = 成功
//			 FALSE = 失敗
//----------------------------------
extern s8 SubGoods( u8 no );

//---------------------------------
//			グッズソート
//	引数 : u8 id = グッズの種類
//---------------------------------
extern void GoodsSort2( u8 id );

//------------------------------------
//			グッズ数チェック
//	引数   : u8 id = グッズの種類
//	戻り値 : その種類の手持ちグッズ数
//-------------------------------------
extern u8 GoodsMaxCheck2( u8 id );

//------------------------------------
//	　手持ちグッズの総数をチェック
//	戻り値 : 手持ちグッズ数
//------------------------------------
extern u8 GoodsMaxCheckAll(void);


#endif	// _GOODS_H
