#=====================================================================
#
#				始めからきのみのエクセルデータを
#				スクリプトコマンド_SET_SEEDの形に出力する
#
#=====================================================================

BEGIN{

	#	NR = 1

	#=================================================================
	#
	#アイテム定義ファイル読み込み
	#
	#=================================================================
	ITEMSYM_H = "../data/itemsym.h"

	#初期化
	count = 0

	#getline = １行読み込み
	#１は戻り値
	while ( 1 == getline < ITEMSYM_H ) 
	{
		if ( NF == 5 && $1 =="#define" ) 
		{
			#定義が二つずつあるので一つを抜き出す
			#if( (count % 2) == 1 )
			#{
				#きのみ系のアイテムのみ取得する
				if( $5 == "タネ先頭番号" )
				{
					start = $3
				}

				#きのみ系のアイテムのみ取得する
				if( $5 ~ "のみ" )
				{
					#"のみ"を削除
					sub(/のみ*/,"",$5)

					ItemName[$5] = $3

					#debug
					#print $5
					#print $3

					count ++
				}
			#}

		}
	}


	#最大数
	count_max = count
	#print count_max

	close(ITEMSYM_H)


	print "//===================================================================="
	print "//					始めから きのみ データ"
	print "//===================================================================="
	print "SCRIPT_LABEL		kinomi_set"
	print ""
}


{
	if( $1 ~ "field" )
	{
		#ID指定が入るとずれる
		if( NF < 5 ) next

		#---------------------------------------------------------
		#					ユーザーID処理(仮)
		#---------------------------------------------------------
		#if( $4 ~ "USER_ID" )
		#{
		#	print "\t_SET_SEED\t" $6 "," #4 ",SEEDSTAT_FRUIT"
		#}

		#---------------------------------------------------------
		#					通常の始めからきのみ
		#---------------------------------------------------------
		#debug
		#print $4
		#print ItemName[$4] 

		#「+1」は関数の始めが１からなので
		no = ItemName[$4] - start + 1
		print "\t_SET_SEED\t" $6 "," no ",SEEDSTAT_FRUIT"
	}
}

END{
	print ""
	print "\t_RET"
	print ""
}
