
const u16 KowazaTable[] = {
		MONSNO_HUSIGIDANE+20000,
		113,		//ひかりのかべ
		130,		//ロケットずつき
		219,		//しんぴのまもり
		204,		//あまえる
		80,		//はなびらのまい
		345,		//マジカルリーフ
		320,		//くさぶえ
		174,		//のろい
		MONSNO_HITOKAGE+20000,
		187,		//はらだいこ
		246,		//げんしのちから
		157,		//いわなだれ
		44,		//かみつく
		200,		//げきりん
		251,		//ふくろだたき
		14,		//つるぎのまい
		349,		//りゅうのまい
		MONSNO_ZENIGAME+20000,
		243,		//ミラーコート
		114,		//くろいきり
		54,		//しろいきり
		193,		//みやぶる
		175,		//じたばた
		287,		//リフレッシュ
		300,		//どろあそび
		281,		//あくび
		MONSNO_POPPO+20000,
		228,		//おいうち
		185,		//だましうち
		193,		//みやぶる
		211,		//はがねのつばさ
		314,		//エアカッター
		MONSNO_KORATTA+20000,
		103,		//いやなおと
		172,		//かえんぐるま
		154,		//みだれひっかき
		44,		//かみつく
		68,		//カウンター
		179,		//きしかいせい
		253,		//さわぐ
		207,		//いばる
		MONSNO_ONISUZUME+20000,
		185,		//だましうち
		206,		//みねうち
		184,		//こわいかお
		98,		//でんこうせっか
		161,		//トライアタック
		310,		//おどろかす
		143,		//ゴッドバード
		MONSNO_AABO+20000,
		228,		//おいうち
		21,		//たたきつける
		180,		//うらみ
		251,		//ふくろだたき
		305,		//どくどくのキバ
		MONSNO_SANDO+20000,
		175,		//じたばた
		219,		//しんぴのまもり
		68,		//カウンター
		229,		//こうそくスピン
		157,		//いわなだれ
		232,		//メタルクロー
		14,		//つるぎのまい
		306,		//ブレイククロー
		MONSNO_NIDORAN_F+20000,
		48,		//ちょうおんぱ
		50,		//かなしばり
		36,		//とっしん
		116,		//きあいだめ
		204,		//あまえる
		68,		//カウンター
		251,		//ふくろだたき
		MONSNO_NIDORAN_M+20000,
		68,		//カウンター
		50,		//かなしばり
		48,		//ちょうおんぱ
		36,		//とっしん
		133,		//ドわすれ
		93,		//ねんりき
		251,		//ふくろだたき
		MONSNO_ROKON+20000,
		185,		//だましうち
		95,		//さいみんじゅつ
		175,		//じたばた
		180,		//うらみ
		50,		//かなしばり
		336,		//とおぼえ
		244,		//じこあんじ
		257,		//ねっぷう
		MONSNO_ZUBATTO+20000,
		98,		//でんこうせっか
		228,		//おいうち
		185,		//だましうち
		16,		//かぜおこし
		18,		//ふきとばし
		174,		//のろい
		MONSNO_NAZONOKUSA+20000,
		14,		//つるぎのまい
		75,		//はっぱカッター
		175,		//じたばた
		235,		//こうごうせい
		204,		//あまえる
		275,		//ねをはる
		MONSNO_PARASU+20000,
		206,		//みねうち
		103,		//いやなおと
		68,		//カウンター
		60,		//サイケこうせん
		175,		//じたばた
		230,		//あまいかおり
		113,		//ひかりのかべ
		228,		//おいうち
		MONSNO_KONPAN+20000,
		226,		//バトンタッチ
		103,		//いやなおと
		202,		//ギガドレイン
		324,		//シグナルビーム
		MONSNO_DHIGUDA+20000,
		185,		//だましうち
		103,		//いやなおと
		246,		//げんしのちから
		228,		//おいうち
		251,		//ふくろだたき
		253,		//さわぐ
		157,		//いわなだれ
		MONSNO_NYAASU+20000,
		180,		//うらみ
		204,		//あまえる
		95,		//さいみんじゅつ
		133,		//ドわすれ
		244,		//じこあんじ
		274,		//ねこのて
		MONSNO_KODAKKU+20000,
		95,		//さいみんじゅつ
		60,		//サイケこうせん
		193,		//みやぶる
		113,		//ひかりのかべ
		248,		//みらいよち
		94,		//サイコキネシス
		238,		//クロスチョップ
		287,		//リフレッシュ
		MONSNO_MANKII+20000,
		157,		//いわなだれ
		193,		//みやぶる
		96,		//ヨガのポーズ
		68,		//カウンター
		179,		//きしかいせい
		251,		//ふくろだたき
		279,		//リベンジ
		265,		//きつけ
		MONSNO_GAADHI+20000,
		34,		//のしかかり
		219,		//しんぴのまもり
		242,		//かみくだく
		37,		//あばれる
		83,		//ほのおのうず
		336,		//とおぼえ
		257,		//ねっぷう
		MONSNO_NYOROMO+20000,
		54,		//しろいきり
		150,		//はねる
		61,		//バブルこうせん
		114,		//くろいきり
		170,		//こころのめ
		346,		//みずあそび
		301,		//アイスボール
		MONSNO_KEESHI+20000,
		227,		//アンコール
		112,		//バリアー
		282,		//はたきおとす
		7,		//ほのおのパンチ
		9,		//かみなりパンチ
		8,		//れいとうパンチ
		MONSNO_WANRIKII+20000,
		113,		//ひかりのかべ
		96,		//ヨガのポーズ
		27,		//まわしげり
		227,		//アンコール
		265,		//きつけ
		68,		//カウンター
		157,		//いわなだれ
		MONSNO_MADATUBOMI+20000,
		14,		//つるぎのまい
		227,		//アンコール
		115,		//リフレクター
		235,		//こうごうせい
		141,		//きゅうけつ
		275,		//ねをはる
		345,		//マジカルリーフ
		MONSNO_MENOKURAGE+20000,
		62,		//オーロラビーム
		243,		//ミラーコート
		229,		//こうそくスピン
		114,		//くろいきり
		219,		//しんぴのまもり
		109,		//あやしいひかり
		MONSNO_ISITUBUTE+20000,
		5,		//メガトンパンチ
		157,		//いわなだれ
		335,		//とおせんぼう
		MONSNO_PONIITA+20000,
		172,		//かえんぐるま
		37,		//あばれる
		24,		//にどげり
		95,		//さいみんじゅつ
		204,		//あまえる
		38,		//すてみタックル
		MONSNO_YADON+20000,
		219,		//しんぴのまもり
		187,		//はらだいこ
		248,		//みらいよち
		23,		//ふみつけ
		300,		//どろあそび
		214,		//ねごと
		173,		//いびき
		MONSNO_KAMONEGI+20000,
		211,		//はがねのつばさ
		193,		//みやぶる
		119,		//オウムがえし
		16,		//かぜおこし
		98,		//でんこうせっか
		175,		//じたばた
		297,		//フェザーダンス
		174,		//のろい
		MONSNO_DOODOO+20000,
		98,		//でんこうせっか
		48,		//ちょうおんぱ
		114,		//くろいきり
		185,		//だましうち
		175,		//じたばた
		283,		//がむしゃら
		MONSNO_PAUWAU+20000,
		122,		//したでなめる
		195,		//ほろびのうた
		50,		//かなしばり
		32,		//つのドリル
		21,		//たたきつける
		227,		//アンコール
		252,		//ねこだまし
		333,		//つららばり
		MONSNO_BETOBETAA+20000,
		114,		//くろいきり
		212,		//くろいまなざし
		122,		//したでなめる
		286,		//ふういん
		174,		//のろい
		325,		//シャドーパンチ
		153,		//だいばくはつ
		MONSNO_SHERUDAA+20000,
		61,		//バブルこうせん
		36,		//とっしん
		112,		//バリアー
		229,		//こうそくスピン
		103,		//いやなおと
		333,		//つららばり
		MONSNO_GOOSU+20000,
		149,		//サイコウェーブ
		195,		//ほろびのうた
		114,		//くろいきり
		310,		//おどろかす
		261,		//おにび
		288,		//おんねん
		153,		//だいばくはつ
		MONSNO_IWAAKU+20000,
		157,		//いわなだれ
		175,		//じたばた
		153,		//だいばくはつ
		335,		//とおせんぼう
		MONSNO_SURIIPU+20000,
		112,		//バリアー
		274,		//ねこのて
		272,		//なりきり
		7,		//ほのおのパンチ
		9,		//かみなりパンチ
		8,		//れいとうパンチ
		MONSNO_KURABU+20000,
		91,		//あなをほる
		114,		//くろいきり
		133,		//ドわすれ
		175,		//じたばた
		21,		//たたきつける
		282,		//はたきおとす
		14,		//つるぎのまい
		MONSNO_TAMATAMA+20000,
		235,		//こうごうせい
		236,		//つきのひかり
		115,		//リフレクター
		246,		//げんしのちから
		244,		//じこあんじ
		275,		//ねをはる
		174,		//のろい
		MONSNO_KARAKARA+20000,
		157,		//いわなだれ
		246,		//げんしのちから
		187,		//はらだいこ
		103,		//いやなおと
		130,		//ロケットずつき
		195,		//ほろびのうた
		14,		//つるぎのまい
		MONSNO_BERORINGA+20000,
		187,		//はらだいこ
		222,		//マグニチュード
		34,		//のしかかり
		174,		//のろい
		265,		//きつけ
		214,		//ねごと
		173,		//いびき
		164,		//みがわり
		MONSNO_DOGAASU+20000,
		103,		//いやなおと
		149,		//サイコウェーブ
		60,		//サイケこうせん
		194,		//みちづれ
		220,		//いたみわけ
		261,		//おにび
		MONSNO_SAIHOON+20000,
		242,		//かみくだく
		179,		//きしかいせい
		157,		//いわなだれ
		68,		//カウンター
		222,		//マグニチュード
		14,		//つるぎのまい
		174,		//のろい
		306,		//ブレイククロー
		MONSNO_RAKKII+20000,
		217,		//プレゼント
		118,		//ゆびをふる
		215,		//いやしのすず
		312,		//アロマセラピー
		164,		//みがわり
		MONSNO_MONZYARA+20000,
		175,		//じたばた
		93,		//ねんりき
		72,		//メガドレイン
		115,		//リフレクター
		133,		//ドわすれ
		73,		//やどりぎのタネ
		267,		//しぜんのちから
		MONSNO_GARUURA+20000,
		23,		//ふみつけ
		193,		//みやぶる
		116,		//きあいだめ
		219,		//しんぴのまもり
		50,		//かなしばり
		68,		//カウンター
		306,		//ブレイククロー
		164,		//みがわり
		MONSNO_TATTUU+20000,
		175,		//じたばた
		62,		//オーロラビーム
		190,		//オクタンほう
		50,		//かなしばり
		150,		//はねる
		82,		//りゅうのいかり
		225,		//りゅうのいぶき
		MONSNO_TOSAKINTO+20000,
		60,		//サイケこうせん
		114,		//くろいきり
		56,		//ハイドロポンプ
		214,		//ねごと
		300,		//どろあそび
		MONSNO_BARIYAADO+20000,
		248,		//みらいよち
		95,		//さいみんじゅつ
		102,		//ものまね
		244,		//じこあんじ
		252,		//ねこだまし
		271,		//トリック
		MONSNO_SUTORAIKU+20000,
		68,		//カウンター
		219,		//しんぴのまもり
		226,		//バトンタッチ
		13,		//かまいたち
		179,		//きしかいせい
		113,		//ひかりのかべ
		203,		//こらえる
		318,		//ぎんいろのかぜ
		MONSNO_KAIROSU+20000,
		31,		//みだれづき
		175,		//じたばた
		206,		//みねうち
		185,		//だましうち
		MONSNO_RAPURASU+20000,
		193,		//みやぶる
		164,		//みがわり
		321,		//くすぐる
		287,		//リフレッシュ
		349,		//りゅうのまい
		174,		//のろい
		214,		//ねごと
		32,		//つのドリル
		MONSNO_IIBUI+20000,
		204,		//あまえる
		175,		//じたばた
		203,		//こらえる
		174,		//のろい
		321,		//くすぐる
		273,		//ねがいごと
		MONSNO_OMUNAITO+20000,
		61,		//バブルこうせん
		62,		//オーロラビーム
		21,		//たたきつける
		48,		//ちょうおんぱ
		114,		//くろいきり
		157,		//いわなだれ
		191,		//まきびし
		MONSNO_KABUTO+20000,
		61,		//バブルこうせん
		62,		//オーロラビーム
		229,		//こうそくスピン
		91,		//あなをほる
		175,		//じたばた
		282,		//はたきおとす
		109,		//あやしいひかり
		MONSNO_PUTERA+20000,
		18,		//ふきとばし
		228,		//おいうち
		193,		//みやぶる
		211,		//はがねのつばさ
		225,		//りゅうのいぶき
		174,		//のろい
		MONSNO_KABIGON+20000,
		122,		//したでなめる
		204,		//あまえる
		38,		//すてみタックル
		174,		//のろい
		90,		//じわれ
		164,		//みがわり
		MONSNO_MINIRYUU+20000,
		113,		//ひかりのかべ
		54,		//しろいきり
		114,		//くろいきり
		48,		//ちょうおんぱ
		225,		//りゅうのいぶき
		349,		//りゅうのまい
		MONSNO_TIKORIITA+20000,
		22,		//つるのムチ
		73,		//やどりぎのタネ
		68,		//カウンター
		246,		//げんしのちから
		175,		//じたばた
		267,		//しぜんのちから
		275,		//ねをはる
		320,		//くさぶえ
		MONSNO_HINOARASI+20000,
		154,		//みだれひっかき
		98,		//でんこうせっか
		179,		//きしかいせい
		37,		//あばれる
		193,		//みやぶる
		343,		//ほしがる
		336,		//とおぼえ
		306,		//ブレイククロー
		MONSNO_WANINOKO+20000,
		242,		//かみくだく
		37,		//あばれる
		56,		//ハイドロポンプ
		246,		//げんしのちから
		157,		//いわなだれ
		300,		//どろあそび
		346,		//みずあそび
		337,		//ドラゴンクロー
		MONSNO_OTATI+20000,
		38,		//すてみタックル
		228,		//おいうち
		163,		//きりさく
		116,		//きあいだめ
		179,		//きしかいせい
		164,		//みがわり
		271,		//トリック
		274,		//ねこのて
		MONSNO_HOOHOO+20000,
		119,		//オウムがえし
		48,		//ちょうおんぱ
		185,		//だましうち
		17,		//つばさでうつ
		18,		//ふきとばし
		143,		//ゴッドバード
		297,		//フェザーダンス
		MONSNO_REDHIBA+20000,
		60,		//サイケこうせん
		117,		//がまん
		318,		//ぎんいろのかぜ
		MONSNO_ITOMARU+20000,
		60,		//サイケこうせん
		50,		//かなしばり
		49,		//ソニックブーム
		226,		//バトンタッチ
		228,		//おいうち
		324,		//シグナルビーム
		MONSNO_TYONTII+20000,
		175,		//じたばた
		103,		//いやなおと
		133,		//ドわすれ
		MONSNO_PITYUU+20000,
		179,		//きしかいせい
		117,		//がまん
		217,		//プレゼント
		227,		//アンコール
		3,		//おうふくビンタ
		273,		//ねがいごと
		268,		//じゅうでん
		MONSNO_PHI+20000,
		217,		//プレゼント
		118,		//ゆびをふる
		133,		//ドわすれ
		187,		//はらだいこ
		150,		//はねる
		102,		//ものまね
		273,		//ねがいごと
		164,		//みがわり
		MONSNO_PUPURIN+20000,
		195,		//ほろびのうた
		217,		//プレゼント
		185,		//だましうち
		273,		//ねがいごと
		313,		//うそなき
		MONSNO_TOGEPII+20000,
		217,		//プレゼント
		119,		//オウムがえし
		64,		//つつく
		193,		//みやぶる
		248,		//みらいよち
		164,		//みがわり
		244,		//じこあんじ
		MONSNO_NEITHI+20000,
		114,		//くろいきり
		65,		//ドリルくちばし
		98,		//でんこうせっか
		185,		//だましうち
		211,		//はがねのつばさ
		244,		//じこあんじ
		297,		//フェザーダンス
		287,		//リフレッシュ
		MONSNO_MERIIPU+20000,
		36,		//とっしん
		34,		//のしかかり
		219,		//しんぴのまもり
		103,		//いやなおと
		115,		//リフレクター
		316,		//かぎわける
		268,		//じゅうでん
		MONSNO_MARIRU+20000,
		113,		//ひかりのかべ
		217,		//プレゼント
		133,		//ドわすれ
		248,		//みらいよち
		187,		//はらだいこ
		195,		//ほろびのうた
		48,		//ちょうおんぱ
		164,		//みがわり
		MONSNO_USOKKII+20000,
		120,		//じばく
		MONSNO_HANEKKO+20000,
		93,		//ねんりき
		227,		//アンコール
		38,		//すてみタックル
		115,		//リフレクター
		133,		//ドわすれ
		270,		//てだすけ
		244,		//じこあんじ
		MONSNO_EIPAMU+20000,
		68,		//カウンター
		103,		//いやなおと
		228,		//おいうち
		97,		//こうそくいどう
		180,		//うらみ
		21,		//たたきつける
		3,		//おうふくビンタ
		251,		//ふくろだたき
		MONSNO_HIMANATTU+20000,
		320,		//くさぶえ
		227,		//アンコール
		73,		//やどりぎのタネ
		267,		//しぜんのちから
		174,		//のろい
		270,		//てだすけ
		MONSNO_YANYANMA+20000,
		18,		//ふきとばし
		179,		//きしかいせい
		141,		//きゅうけつ
		324,		//シグナルビーム
		318,		//ぎんいろのかぜ
		MONSNO_UPAA+20000,
		34,		//のしかかり
		246,		//げんしのちから
		219,		//しんぴのまもり
		174,		//のろい
		300,		//どろあそび
		254,		//たくわえる
		256,		//のみこむ
		255,		//はきだす
		MONSNO_YAMIKARASU+20000,
		18,		//ふきとばし
		65,		//ドリルくちばし
		119,		//オウムがえし
		17,		//つばさでうつ
		143,		//ゴッドバード
		109,		//あやしいひかり
		297,		//フェザーダンス
		195,		//ほろびのうた
		MONSNO_MUUMA+20000,
		103,		//いやなおと
		194,		//みちづれ
		244,		//じこあんじ
		286,		//ふういん
		MONSNO_KIRINRIKI+20000,
		36,		//とっしん
		133,		//ドわすれ
		193,		//みやぶる
		248,		//みらいよち
		251,		//ふくろだたき
		244,		//じこあんじ
		273,		//ねがいごと
		277,		//マジックコート
		MONSNO_KUNUGIDAMA+20000,
		115,		//リフレクター
		42,		//ミサイルばり
		175,		//じたばた
		129,		//スピードスター
		68,		//カウンター
		328,		//すなじごく
		MONSNO_NOKOTTI+20000,
		117,		//がまん
		246,		//げんしのちから
		157,		//いわなだれ
		44,		//かみつく
		29,		//ずつき
		310,		//おどろかす
		174,		//のろい
		MONSNO_GURAIGAA+20000,
		232,		//メタルクロー
		17,		//つばさでうつ
		13,		//かまいたち
		68,		//カウンター
		328,		//すなじごく
		MONSNO_BURUU+20000,
		118,		//ゆびをふる
		185,		//だましうち
		115,		//リフレクター
		217,		//プレゼント
		242,		//かみくだく
		215,		//いやしのすず
		173,		//いびき
		265,		//きつけ
		MONSNO_HARIISEN+20000,
		175,		//じたばた
		114,		//くろいきり
		61,		//バブルこうせん
		48,		//ちょうおんぱ
		310,		//おどろかす
		MONSNO_TUBOTUBO+20000,
		230,		//あまいかおり
		MONSNO_HERAKUROSU+20000,
		106,		//かたくなる
		117,		//がまん
		175,		//じたばた
		206,		//みねうち
		MONSNO_NYUURA+20000,
		68,		//カウンター
		180,		//うらみ
		193,		//みやぶる
		115,		//リフレクター
		44,		//かみつく
		306,		//ブレイククロー
		252,		//ねこだまし
		MONSNO_HIMEGUMA+20000,
		242,		//かみくだく
		36,		//とっしん
		69,		//ちきゅうなげ
		68,		//カウンター
		232,		//メタルクロー
		313,		//うそなき
		281,		//あくび
		214,		//ねごと
		MONSNO_MAGUMAGGU+20000,
		151,		//とける
		257,		//ねっぷう
		MONSNO_URIMUU+20000,
		36,		//とっしん
		44,		//かみつく
		34,		//のしかかり
		157,		//いわなだれ
		246,		//げんしのちから
		341,		//マッドショット
		333,		//つららばり
		38,		//すてみタックル
		MONSNO_SANIIGO+20000,
		157,		//いわなだれ
		103,		//いやなおと
		54,		//しろいきり
		133,		//ドわすれ
		112,		//バリアー
		275,		//ねをはる
		109,		//あやしいひかり
		333,		//つららばり
		MONSNO_TEPPOUO+20000,
		62,		//オーロラビーム
		190,		//オクタンほう
		48,		//ちょうおんぱ
		114,		//くろいきり
		103,		//いやなおと
		86,		//でんじは
		350,		//ロックブラスト
		MONSNO_DERIBAADO+20000,
		62,		//オーロラビーム
		98,		//でんこうせっか
		248,		//みらいよち
		150,		//はねる
		229,		//こうそくスピン
		301,		//アイスボール
		MONSNO_MANTAIN+20000,
		239,		//たつまき
		56,		//ハイドロポンプ
		114,		//くろいきり
		21,		//たたきつける
		300,		//どろあそび
		157,		//いわなだれ
		MONSNO_EAAMUDO+20000,
		65,		//ドリルくちばし
		228,		//おいうち
		18,		//ふきとばし
		143,		//ゴッドバード
		174,		//のろい
		MONSNO_DERUBIRU+20000,
		83,		//ほのおのうず
		99,		//いかり
		228,		//おいうち
		68,		//カウンター
		180,		//うらみ
		179,		//きしかいせい
		251,		//ふくろだたき
		261,		//おにび
		MONSNO_GOMAZOU+20000,
		116,		//きあいだめ
		34,		//のしかかり
		246,		//げんしのちから
		173,		//いびき
		68,		//カウンター
		90,		//じわれ
		MONSNO_ODOSISI+20000,
		180,		//うらみ
		50,		//かなしばり
		44,		//かみつく
		207,		//いばる
		244,		//じこあんじ
		326,		//じんつうりき
		MONSNO_BARUKII+20000,
		229,		//こうそくスピン
		136,		//とびひざげり
		183,		//マッハパンチ
		170,		//こころのめ
		270,		//てだすけ
		MONSNO_MUTYUURU+20000,
		96,		//ヨガのポーズ
		244,		//じこあんじ
		252,		//ねこだまし
		273,		//ねがいごと
		8,		//れいとうパンチ
		MONSNO_EREKIDDO+20000,
		2,		//からてチョップ
		112,		//バリアー
		27,		//まわしげり
		96,		//ヨガのポーズ
		238,		//クロスチョップ
		7,		//ほのおのパンチ
		8,		//れいとうパンチ
		MONSNO_BUBHI+20000,
		2,		//からてチョップ
		5,		//メガトンパンチ
		112,		//バリアー
		103,		//いやなおと
		238,		//クロスチョップ
		9,		//かみなりパンチ
		MONSNO_MIRUTANKU+20000,
		217,		//プレゼント
		179,		//きしかいせい
		69,		//ちきゅうなげ
		203,		//こらえる
		244,		//じこあんじ
		174,		//のろい
		270,		//てだすけ
		214,		//ねごと
		MONSNO_YOOGIRASU+20000,
		228,		//おいうち
		23,		//ふみつけ
		200,		//げきりん
		116,		//きあいだめ
		246,		//げんしのちから
		349,		//りゅうのまい
		174,		//のろい
		MONSNO_KIMORI+20000,
		242,		//かみくだく
		300,		//どろあそび
		283,		//がむしゃら
		73,		//やどりぎのタネ
		225,		//りゅうのいぶき
		306,		//ブレイククロー
		MONSNO_ATYAMO+20000,
		68,		//カウンター
		179,		//きしかいせい
		203,		//こらえる
		207,		//いばる
		157,		//いわなだれ
		265,		//きつけ
		MONSNO_MIZUGOROU+20000,
		287,		//リフレッシュ
		253,		//さわぐ
		174,		//のろい
		23,		//ふみつけ
		301,		//アイスボール
		243,		//ミラーコート
		MONSNO_POTIENA+20000,
		310,		//おどろかす
		305,		//どくどくのキバ
		343,		//ほしがる
		43,		//にらみつける
		281,		//あくび
		MONSNO_ZIGUZAGUMA+20000,
		204,		//あまえる
		228,		//おいうち
		164,		//みがわり
		321,		//くすぐる
		271,		//トリック
		MONSNO_HASUBOO+20000,
		235,		//こうごうせい
		75,		//はっぱカッター
		230,		//あまいかおり
		73,		//やどりぎのタネ
		175,		//じたばた
		55,		//みずでっぽう
		MONSNO_TANEBOO+20000,
		73,		//やどりぎのタネ
		133,		//ドわすれ
		98,		//でんこうせっか
		13,		//かまいたち
		36,		//とっしん
		206,		//みねうち
		MONSNO_TUTININ+20000,
		203,		//こらえる
		185,		//だましうち
		16,		//かぜおこし
		318,		//ぎんいろのかぜ
		MONSNO_SUBAME+20000,
		228,		//おいうち
		48,		//ちょうおんぱ
		287,		//リフレッシュ
		119,		//オウムがえし
		99,		//いかり
		143,		//ゴッドバード
		MONSNO_KINOKOKO+20000,
		313,		//うそなき
		207,		//いばる
		204,		//あまえる
		206,		//みねうち
		270,		//てだすけ
		MONSNO_PATTIIRU+20000,
		227,		//アンコール
		157,		//いわなだれ
		274,		//ねこのて
		50,		//かなしばり
		226,		//バトンタッチ
		273,		//ねがいごと
		271,		//トリック
		265,		//きつけ
		MONSNO_KYAMOME+20000,
		54,		//しろいきり
		239,		//たつまき
		97,		//こうそくいどう
		16,		//かぜおこし
		346,		//みずあそび
		MONSNO_AMETAMA+20000,
		193,		//みやぶる
		341,		//マッドショット
		60,		//サイケこうせん
		56,		//ハイドロポンプ
		170,		//こころのめ
		MONSNO_HOERUKO+20000,
		38,		//すてみタックル
		37,		//あばれる
		207,		//いばる
		173,		//いびき
		214,		//ねごと
		174,		//のろい
		90,		//じわれ
		321,		//くすぐる
		MONSNO_ENEKO+20000,
		270,		//てだすけ
		244,		//じこあんじ
		253,		//さわぐ
		313,		//うそなき
		273,		//ねがいごと
		226,		//バトンタッチ
		164,		//みがわり
		321,		//くすぐる
		MONSNO_KAKUREON+20000,
		50,		//かなしばり
		277,		//マジックコート
		271,		//トリック
		MONSNO_NOZUPASU+20000,
		222,		//マグニチュード
		205,		//ころがる
		153,		//だいばくはつ
		MONSNO_KOOTASU+20000,
		284,		//ふんか
		203,		//こらえる
		214,		//ねごと
		281,		//あくび
		MONSNO_YAMIRAMI+20000,
		244,		//じこあんじ
		105,		//じこさいせい
		236,		//つきのひかり
		MONSNO_DOZYOTTI+20000,
		37,		//あばれる
		250,		//うずしお
		209,		//スパーク
		MONSNO_RABUKASU+20000,
		150,		//はねる
		48,		//ちょうおんぱ
		346,		//みずあそび
		300,		//どろあそび
		MONSNO_HEIGANI+20000,
		300,		//どろあそび
		283,		//がむしゃら
		34,		//のしかかり
		246,		//げんしのちから
		MONSNO_HINBASU+20000,
		243,		//ミラーコート
		225,		//りゅうのいぶき
		300,		//どろあそび
		95,		//さいみんじゅつ
		113,		//ひかりのかべ
		109,		//あやしいひかり
		MONSNO_KIBANIA+20000,
		56,		//ハイドロポンプ
		38,		//すてみタックル
		37,		//あばれる
		MONSNO_NAKKURAA+20000,
		116,		//きあいだめ
		98,		//でんこうせっか
		16,		//かぜおこし
		MONSNO_MAKUNOSITA+20000,
		185,		//だましうち
		197,		//みきり
		193,		//みやぶる
		270,		//てだすけ
		238,		//クロスチョップ
		279,		//リベンジ
		223,		//ばくれつパンチ
		68,		//カウンター
		MONSNO_RAKURAI+20000,
		242,		//かみくだく
		29,		//ずつき
		253,		//さわぐ
		174,		//のろい
		129,		//スピードスター
		MONSNO_DONMERU+20000,
		336,		//とおぼえ
		184,		//こわいかお
		34,		//のしかかり
		205,		//ころがる
		111,		//まるくなる
		23,		//ふみつけ
		MONSNO_TAMAZARASI+20000,
		346,		//みずあそび
		254,		//たくわえる
		256,		//のみこむ
		255,		//はきだす
		281,		//あくび
		157,		//いわなだれ
		174,		//のろい
		90,		//じわれ
		MONSNO_SABONEA+20000,
		320,		//くさぶえ
		51,		//ようかいえき
		298,		//フラフラダンス
		223,		//ばくれつパンチ
		68,		//カウンター
		MONSNO_YUKIWARASI+20000,
		335,		//とおせんぼう
		191,		//まきびし
		MONSNO_RURIRI+20000,
		227,		//アンコール
		47,		//うたう
		287,		//リフレッシュ
		21,		//たたきつける
		321,		//くすぐる
		MONSNO_BANEBUU+20000,
		248,		//みらいよち
		326,		//じんつうりき
		164,		//みがわり
		271,		//トリック
		MONSNO_PURASURU+20000,
		164,		//みがわり
		273,		//ねがいごと
		MONSNO_MAINAN+20000,
		164,		//みがわり
		273,		//ねがいごと
		MONSNO_KUTIITO+20000,
		14,		//つるぎのまい
		206,		//みねうち
		305,		//どくどくのキバ
		244,		//じこあんじ
		246,		//げんしのちから
		321,		//くすぐる
		MONSNO_ASANAN+20000,
		7,		//ほのおのパンチ
		9,		//かみなりパンチ
		8,		//れいとうパンチ
		193,		//みやぶる
		252,		//ねこだまし
		226,		//バトンタッチ
		223,		//ばくれつパンチ
		MONSNO_TIRUTTO+20000,
		97,		//こうそくいどう
		114,		//くろいきり
		228,		//おいうち
		99,		//いかり
		MONSNO_YOMAWARU+20000,
		286,		//ふういん
		194,		//みちづれ
		220,		//いたみわけ
		288,		//おんねん
		262,		//おきみやげ
		185,		//だましうち
		MONSNO_ROZERIA+20000,
		191,		//まきびし
		235,		//こうごうせい
		42,		//ミサイルばり
		178,		//わたほうし
		MONSNO_NAMAKERO+20000,
		228,		//おいうち
		163,		//きりさく
		34,		//のしかかり
		173,		//いびき
		306,		//ブレイククロー
		174,		//のろい
		214,		//ねごと
		MONSNO_GOKURIN+20000,
		138,		//ゆめくい
		151,		//とける
		123,		//スモッグ
		220,		//いたみわけ
		MONSNO_TOROPIUSU+20000,
		29,		//ずつき
		21,		//たたきつける
		13,		//かまいたち
		73,		//やどりぎのタネ
		267,		//しぜんのちから
		MONSNO_GONYONYO+20000,
		36,		//とっしん
		173,		//いびき
		207,		//いばる
		326,		//じんつうりき
		265,		//きつけ
		MONSNO_PAARURU+20000,
		287,		//リフレッシュ
		300,		//どろあそび
		34,		//のしかかり
		48,		//ちょうおんぱ
		112,		//バリアー
		109,		//あやしいひかり
		MONSNO_ABUSORU+20000,
		226,		//バトンタッチ
		185,		//だましうち
		38,		//すてみタックル
		277,		//マジックコート
		174,		//のろい
		164,		//みがわり
		MONSNO_KAGEBOUZU+20000,
		50,		//かなしばり
		194,		//みちづれ
		193,		//みやぶる
		310,		//おどろかす
		286,		//ふういん
		MONSNO_HABUNEEKU+20000,
		254,		//たくわえる
		256,		//のみこむ
		255,		//はきだす
		34,		//のしかかり
		MONSNO_ZANGUUSU+20000,
		175,		//じたばた
		24,		//にどげり
		13,		//かまいたち
		68,		//カウンター
		46,		//ほえる
		174,		//のろい
		MONSNO_ZIIRANSU+20000,
		222,		//マグニチュード
		130,		//ロケットずつき
		346,		//みずあそび
		133,		//ドわすれ
		214,		//ねごと
		157,		//いわなだれ
		MONSNO_KOKODORA+20000,
		283,		//がむしゃら
		34,		//のしかかり
		23,		//ふみつけ
		265,		//きつけ
		MONSNO_POWARUN+20000,
		248,		//みらいよち
		244,		//じこあんじ
		MONSNO_BARUBIITO+20000,
		226,		//バトンタッチ
		318,		//ぎんいろのかぜ
		271,		//トリック
		MONSNO_IRUMIIZE+20000,
		226,		//バトンタッチ
		318,		//ぎんいろのかぜ
		74,		//せいちょう
		MONSNO_RIRIIRA+20000,
		112,		//バリアー
		105,		//じこさいせい
		243,		//ミラーコート
		157,		//いわなだれ
		MONSNO_ANOPUSU+20000,
		229,		//こうそくスピン
		282,		//はたきおとす
		14,		//つるぎのまい
		157,		//いわなだれ
		MONSNO_RARUTOSU+20000,
		50,		//かなしばり
		261,		//おにび
		212,		//くろいまなざし
		262,		//おきみやげ
		194,		//みちづれ
		MONSNO_TATUBEI+20000,
		56,		//ハイドロポンプ
		37,		//あばれる
		82,		//りゅうのいかり
		239,		//たつまき
		349,		//りゅうのまい
		MONSNO_TIRIIN+20000,
		50,		//かなしばり
		174,		//のろい
		95,		//さいみんじゅつ
		138,		//ゆめくい
		0xffff,		//終端
};
#define KOWAZA_TABLE_MAX (1138)
