//==================================================================================
//
//	map_attr.c
//
//	マップアトリビュートチェック関連
//
//	2001.05.16	GAME FREAK Inc.
//==================================================================================

#include "common.h"

#define	MAP_ATTR_H_GLOBAL
#include "map_attr.h"

/* マップアトリビュート属性データ */
#include "../data/map_attr_table.c"

//SITE_UP参照のため
#include "map.h"

#define	ATTR_ENTER_MASK		0x04
#define ATTR_WATER_MASK		0x02
#define	ATTR_ENCOUNT_MASK	0x01

//==================================================================================
//==================================================================================

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：歩けるかどうか
//＜返値＞	TRUE	歩ける
// 			FALSE	歩けない
//-------------------------------------------------------------------------
u8 ATR_WalkEnableCheck(u8 attr)
{
	return TRUE;
	//	return WalkEnableTable[attr];
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：エンカウントするかどうか
//＜返値＞	TRUE	エンカウントする
// 			FALSE	エンカウントしない
//-------------------------------------------------------------------------
u8 ATR_EncountCheck(u8 attr)
{
	if (MapAttrTable[attr] & ATTR_ENCOUNT_MASK)
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：右方向にジャンプするかどうか
//＜返値＞	TRUE	ジャンプできる
// 			FALSE	ジャンプできない
//-------------------------------------------------------------------------
u8 ATR_JumpRightEnableCheck(u8 attr)
{
		if( attr == 0x38 )
				return TRUE;
		else
				return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：左方向にジャンプするかどうか
//＜返値＞	TRUE	ジャンプできる
// 			FALSE	ジャンプできない
//-------------------------------------------------------------------------
u8 ATR_JumpLeftEnableCheck(u8 attr)
{
		if( attr == 0x39 )
				return TRUE;
		else
				return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：上方向にジャンプするかどうか
//＜返値＞	TRUE	ジャンプできる
// 			FALSE	ジャンプできない
//-------------------------------------------------------------------------
u8 ATR_JumpUpEnableCheck(u8 attr)
{
		if( attr == 0x3a )
				return TRUE;
		else
				return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：下方向にジャンプするかどうか
//＜返値＞	TRUE	ジャンプできる
// 			FALSE	ジャンプできない
//-------------------------------------------------------------------------
u8 ATR_JumpDownEnableCheck(u8 attr)
{
		if( attr == 0x3b )
				return TRUE;
		else
				return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：草むらかどうかのチェック
//＜返値＞	TRUE	草の場所
// 			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsGrassCheck(u8 attr)
{
		if( attr == 0x02 || attr == 0x03 )
				return TRUE;
		else
				return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：砂アトリビュートかどうか
//	<返値>	TRUE	砂
//			FALSE	砂以外
//-------------------------------------------------------------------------
u8 ATR_IsSandCheck(u8 attr)
{
	if( attr == 0x21 || attr == 0x06 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：深い砂アトリビュートかどうか
//	<返値>	TRUE	深い砂
//			FALSE	深い砂以外
//-------------------------------------------------------------------------
u8 ATR_IsDeepSandCheck(u8 attr)
{
	if( attr == 0x06 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：映り込みするアトリビュートかどうか
//	<返値>	TRUE	映り込みする
//			FALSE	映り込みしない
//-------------------------------------------------------------------------
u8 ATR_IsReflectCheck(u8 attr)
{
	if( attr == 0x10 || attr == 0x16 || attr == 0x1a || attr == 0x20 ||
		attr == 0x14 || attr == 0x2b )
		return TRUE;
	else
		return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：映り込み氷アトリビュートかどうか
//	<返値>	TRUE	映り込み氷
//			FALSE	氷ではない
//-------------------------------------------------------------------------
u8 ATR_IsReflectIceCheck( u8 attr )
{
	if( attr == 0x20 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：ドアのアトリビュートかどうか
//	<返値>	TRUE	ドア
//			FALSE	ドア以外
//-------------------------------------------------------------------------
u8 ATR_IsDoorCheck(u8 attr)
{
		if( attr == 0x69 )
				return TRUE;
		else
				return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：ドアのエフェクトが有効かどうか
//	<返値>	TRUE	有効
//			FALSE	有効でない
//-------------------------------------------------------------------------
u8 ATR_DoorEffectCheck(u8 attr)
{
	if( attr == 0x8d || attr == 0x69 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：エスカレーターかどうか
//	<返値>	TRUE	エスカレーター
//			FALSE	エスカレーター以外
//-------------------------------------------------------------------------
u8 ATR_IsEscalatorCheck(u8 attr)
{
		if( attr == 0x6a || attr == 0x6b )
				return TRUE;
		else
				return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：斬れる木のアトリビュートかどうか
//	<返値>	TRUE	斬れる木
//			FALSE	斬れる木以外
//-------------------------------------------------------------------------
u8 ATR_IsTreeCheck(u8 attr)
{
		if( attr == 0x04)
				return TRUE;
		else
				return FALSE;
};


//-------------------------------------------------------------------------
//	マップアトリビュートチェック：はしごのアトリビュートかどうか
//	<返値>	TRUE	はしご
//			FALSE	はしご以外
//-------------------------------------------------------------------------
u8 ATR_IsLadderCheck(u8 attr)
{
		if( attr == 0x61 )
				return TRUE;
		else
				return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：壁の出入口のアトリビュートかどうか
//	<返値>	TRUE	壁の出入り口
//			FALSE	壁の出入り口以外
//-------------------------------------------------------------------------
u8 ATR_IsWallExitCheck(u8 attr)
{
		if( attr == 0x60 || attr == 0x6c || attr == 0x6e )
				return TRUE;
		else
				return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：壁の出入口上方向のアトリビュートかどうか
//	<返値>	TRUE	壁の出入り口
//			FALSE	壁の出入り口以外
//-------------------------------------------------------------------------
u8 ATR_IsWallExitUpCheck(u8 attr)
{
		if( attr == 0x6e )
			return TRUE;
		else
			return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：水アトリビュートかどうか
//	<返値>	TRUE	水
//			FALSE	水以外
//-------------------------------------------------------------------------
u8 ATR_IsWaterCheck(u8 attr)
{
	if ( MapAttrTable[attr] & ATTR_WATER_MASK )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：右方向に出るマットかどうか
//	<返値>	TRUE	マット
//			FALSE	マット以外
//-------------------------------------------------------------------------
u8 ATR_ExitMatRightEnableCheck(u8 attr)
{
		if( attr == 0x62 )
				return TRUE;
		else
				return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：左方向に出るマットかどうか
//	<返値>	TRUE	マット
//			FALSE	マット以外
//-------------------------------------------------------------------------
u8 ATR_ExitMatLeftEnableCheck(u8 attr)
{
		if( attr == 0x63 )
				return TRUE;
		else
				return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：上方向に出るマットかどうか
//	<返値>	TRUE	マット
//			FALSE	マット以外
//-------------------------------------------------------------------------
u8 ATR_ExitMatUpEnableCheck(u8 attr)
{
		if( attr == 0x64 || attr == 0x1b )
				return TRUE;
		else
				return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：下方向に出るマットかどうか
//	<返値>	TRUE	マット
//			FALSE	マット以外
//-------------------------------------------------------------------------
u8 ATR_ExitMatDownEnableCheck(u8 attr)
{
		if( attr == 0x65 || attr == 0x6d || attr == 0x1c )
				return TRUE;
		else
				return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：マットかどうか
//	<返値>	TRUE	マット
//			FALSE	マット以外
//-------------------------------------------------------------------------
u8 ATR_ExitMatEnableCheck(u8 attr)
{
		return ( ATR_ExitMatRightEnableCheck(attr) || ATR_ExitMatLeftEnableCheck(attr)
						|| ATR_ExitMatUpEnableCheck(attr) || ATR_ExitMatDownEnableCheck(attr) );
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：強制移動地形かどうか
//	<返値>	TRUE	そうです
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsForceMoveCheck(u8 attr)
{
	if (
			( 0x40 <= attr && attr <= 0x48 )	//強制移動（陸上）
			|| ( 0x50<=attr && attr<=0x53 )		//強制移動（水上）
			|| attr == 0xd0						//すべる坂
			|| attr == 0xd2						//壊れる床
			|| attr == 0x13						//滝
			|| attr == 0x20						//氷床
			|| attr == 0xbb						//ジャンピングマット
			|| attr == 0xbc						//くるっとマット
			)
	{
		return TRUE;
	} else {
		return FALSE;
	}
}
//-------------------------------------------------------------------------
//	マップアトリビュートチェック：すべるフロアかどうか(氷)
//	<返値>	TRUE	すべる
//			FALSE	すべらない
//-------------------------------------------------------------------------
u8 ATR_IsSlipFloorIceCheck(u8 attr)
{
	if( attr == 0x20 )
		return TRUE;
	else
		return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：すべるフロアかどうか(室内床)
//	<返値>	TRUE	すべる
//			FALSE	すべらない
//-------------------------------------------------------------------------
u8 ATR_IsSlipFloorRoomCheck(u8 attr)
{
	if( attr == 0x48 )
		return TRUE;
	else
		return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：頭突きの木のアトリビュートかどうか
//	<返値>	TRUE	頭突きの木
//			FALSE	頭突きの木以外
//-------------------------------------------------------------------------
u8 ATR_IsZutukiTreeCheck(u8 attr)
{
		if( attr == 0x05 )
				return TRUE;
		else
				return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：上方向に強制移動するかどうか
//	<返値>	TRUE	強制移動する
//			FALSE	強制移動しない
//-------------------------------------------------------------------------
u8 ATR_IsUpForceMoveCheck(u8 attr)
{
	if( attr == 0x42 )
		return TRUE;
	else
		return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：下方向に強制移動するかどうか
//	<返値>	TRUE	強制移動する
//			FALSE	強制移動しない
//-------------------------------------------------------------------------
u8 ATR_IsDownForceMoveCheck(u8 attr)
{
	if( attr == 0x43 )
		return TRUE;
	else
		return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：左方向に強制移動するかどうか
//	<返値>	TRUE	強制移動する
//			FALSE	強制移動しない
//-------------------------------------------------------------------------
u8 ATR_IsLeftForceMoveCheck(u8 attr)
{
	if( attr == 0x41 )
		return TRUE;
	else
		return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：右方向に強制移動するかどうか
//	<返値>	TRUE	強制移動する
//			FALSE	強制移動しない
//-------------------------------------------------------------------------
u8 ATR_IsRightForceMoveCheck(u8 attr)
{
	if( attr == 0x40 )
		return TRUE;
	else
		return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：上方向に強制移動 海流
//	<返値>	TRUE	強制移動する
//			FALSE	強制移動しない
//-------------------------------------------------------------------------
u8 ATR_IsUpForceMoveCurrentCheck(u8 attr)
{
	if( attr == 0x52 )
		return TRUE;
	else
		return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：下方向に強制移動 海流
//	<返値>	TRUE	強制移動する
//			FALSE	強制移動しない
//-------------------------------------------------------------------------
u8 ATR_IsDownForceMoveCurrentCheck(u8 attr)
{
	if( attr == 0x53 )
		return TRUE;
	else
		return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：左方向に強制移動 海流
//	<返値>	TRUE	強制移動する
//			FALSE	強制移動しない
//-------------------------------------------------------------------------
u8 ATR_IsLeftForceMoveCurrentCheck(u8 attr)
{
	if( attr == 0x51 )
		return TRUE;
	else
		return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：右方向に強制移動 海流
//	<返値>	TRUE	強制移動する
//			FALSE	強制移動しない
//-------------------------------------------------------------------------
u8 ATR_IsRightForceMoveCurrentCheck(u8 attr)
{
	if( attr == 0x50 )
		return TRUE;
	else
		return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：上方向に方向固定のまま強制移動するかどうか
//	<返値>	TRUE	強制移動する
//			FALSE	強制移動しない
//-------------------------------------------------------------------------
u8 ATR_IsUpForcePushCheck(u8 attr)
{
	if( attr == 0x46 )
		return TRUE;
	else
		return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：下方向に方向固定のまま強制移動するかどうか
//	<返値>	TRUE	強制移動する
//			FALSE	強制移動しない
//-------------------------------------------------------------------------
u8 ATR_IsDownForcePushCheck(u8 attr)
{
	if( attr == 0x47 )
		return TRUE;
	else
		return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：左方向に方向固定のまま強制移動するかどうか
//	<返値>	TRUE	強制移動する
//			FALSE	強制移動しない
//-------------------------------------------------------------------------
u8 ATR_IsLeftForcePushCheck(u8 attr)
{
	if( attr == 0x45 )
		return TRUE;
	else
		return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：右方向に方向固定のまま強制移動するかどうか
//	<返値>	TRUE	強制移動する
//			FALSE	強制移動しない
//-------------------------------------------------------------------------
u8 ATR_IsRightForcePushCheck(u8 attr)
{
	if( attr == 0x44 )
		return TRUE;
	else
		return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：1セル向こうに話かけられるかどうか
//＜返値＞	TRUE	できる
// 			FALSE	できない
//-------------------------------------------------------------------------
u8 ATR_IsCounterCheck(u8 attr)
{
	if( attr == 0x80 )
		return TRUE;
	else
		return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：ＴＶかどうか
//＜返値＞	TRUE	ＴＶである
// 			FALSE	違う
//-------------------------------------------------------------------------
u8 ATR_IsTVCheck(u8 attr, u8 site)
{
	//下方向からの話し掛けのみ対応
	if( site != SITE_UP )	return FALSE;

	if( attr == 0x86 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：パソコンかどうか
//＜返値＞	TRUE	パソコン
// 			FALSE	違う
//-------------------------------------------------------------------------
u8 ATR_IsPasoCheck(u8 attr)
{
	if( attr == 0x83 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：対戦表かどうか
//＜返値＞	TRUE	対戦表
// 			FALSE	違う
//-------------------------------------------------------------------------
u8 ATR_IsScoreBoardCheck( u8 attr )
{
	if( attr == 0x84 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：秘密基地の入り口かどうか
//＜返値＞	TRUE	入り口
// 			FALSE	入り口以外
//-------------------------------------------------------------------------
u8 ATR_IsBaseDoorCheck(u8 attr)
{
	if( attr == 0x91 || attr == 0x93 || attr == 0x95 || attr == 0x97 ||
		attr == 0x99 || attr == 0x9b || attr == 0x9d	)
	{
		return TRUE;
	}else{
		return FALSE;
	}
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：スコップで秘密基地が作れるか
//＜返値＞	TRUE	作れる
// 			FALSE	作れない
//-------------------------------------------------------------------------
u8 ATR_IsMakeScoopBaseCheck(u8 attr)
{
	if( attr == 0x90 || attr == 0x92 || attr == 0x94 || attr == 0x9a )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：ロープで秘密基地が作れるか
//＜返値＞	TRUE	作れる
// 			FALSE	作れない
//-------------------------------------------------------------------------
u8 ATR_IsMakeRopeBaseCheck(u8 attr)
{
	if( attr == 0x96 || attr == 0x9c )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：カマで秘密基地が作れるか
//＜返値＞	TRUE	作れる
// 			FALSE	作れない
//-------------------------------------------------------------------------
u8 ATR_IsMakeKamaBaseCheck(u8 attr)
{
	if( attr == 0x98 )	return TRUE;
	else				return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：秘密の箱か
//＜返値＞	TRUE	箱
// 			FALSE	箱以外
//-------------------------------------------------------------------------
u8 ATR_IsBaseSecretBoxCheck(u8 attr)
{
	if( attr == 0xb0 )	return TRUE;
	else				return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：基地の掲示板か
//＜返値＞	TRUE	掲示板
// 			FALSE	掲示板以外
//-------------------------------------------------------------------------
u8 ATR_IsBaseBoardCheck(u8 attr)
{
	if( attr == 0xb1 )	return TRUE;
	else				return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：グッズ交換箱か
//＜返値＞	TRUE	箱
// 			FALSE	箱以外
//-------------------------------------------------------------------------
u8 ATR_IsGoodsChangeBoxCheck(u8 attr)
{
	if( attr == 0xb2 )	return TRUE;
	else				return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：お留守番キャラの表示位置か
//＜返値＞	TRUE	表示位置
// 			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsBaseCharCheck(u8 attr)
{
	if( attr == 0xb3 )	return TRUE;
	else				return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：歩けない場所でお留守番キャラが置けない
//＜返値＞	TRUE	表示位置
// 			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsBaseNoWalkCheck(u8 attr)
{
	if( attr == 0xb9 )	return TRUE;
	else				return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：床にグッズが置けるか
//＜返値＞	TRUE	置ける
// 			FALSE	置けない
//-------------------------------------------------------------------------
u8 ATR_IsGoodsPutFloorCheck( u8 attr )
{
	if( attr == 0 )	return TRUE;
	else			return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：壁にグッズが置けるか
//＜返値＞	TRUE	置ける
// 			FALSE	置けない
//-------------------------------------------------------------------------
u8 ATR_IsGoodsPutWallCheck( u8 attr )
{
	if( attr == 0xb7 )	return TRUE;
	else				return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：グッズは置けないが歩ける場所か
//＜返値＞	TRUE	はい
// 			FALSE	いいえ
//-------------------------------------------------------------------------
u8 ATR_IsGoodsNotPutWalkCheck( u8 attr )
{
	if( attr == 0xb2 )	return TRUE;
	else				return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：グッズの上にグッズが置けるか
//＜返値＞	TRUE	置ける
// 			FALSE	置けない
//-------------------------------------------------------------------------
u8 ATR_IsGoodsPutGoodsCheck( u8 attr )
{
	if( attr == 0xb5 )	return	TRUE;
	else				return	FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：大きいぬいぐるみが置ける場所か
//＜返値＞	TRUE	置ける
// 			FALSE	置けない
//-------------------------------------------------------------------------
u8 ATR_IsBigDollPutCheck( u8 attr )
{
	if( attr == 0xc3 )	return	TRUE;
	else				return	FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：丈夫な板が置ける場所か
//＜返値＞	TRUE	置ける
// 			FALSE	置けない
//-------------------------------------------------------------------------
u8 ATR_IsGoodsPutIta( u8 attr )
{
	if( attr == 0xc2 )	return TRUE;
	else				return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：グッズ・水風船＆泥団子
//＜返値＞	TRUE	はい
// 			FALSE	いいえ
//-------------------------------------------------------------------------
u8 ATR_IsBreakGoodsCheck( u8 attr )
{
	if( attr == 0xb8 )	return TRUE;
	else				return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：グッズ・つきやぶれるドア
//＜返値＞	TRUE	はい
// 			FALSE	いいえ
//-------------------------------------------------------------------------
u8 ATR_IsBaseBreakDoorCheck( u8 attr )
{
	if( attr == 0xbe )	return TRUE;
	else				return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：グッズ・音マット
//＜返値＞	TRUE	はい
// 			FALSE	いいえ
//-------------------------------------------------------------------------
u8 ATR_IsBaseSoundMatCheck( u8 attr )
{
	if( attr == 0xbd )	return TRUE;
	else				return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：グッズ・真っ暗マット
//＜返値＞	TRUE	はい
// 			FALSE	いいえ
//-------------------------------------------------------------------------
u8 ATR_IsBaseDarkMatCheck( u8 attr )
{
	if( attr == 0xba )	return TRUE;
	else				return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：グッズ・砂の置物
//＜返値＞	TRUE	はい
// 			FALSE	いいえ
//-------------------------------------------------------------------------
u8 ATR_IsBaseSndObjCheck( u8 attr )
{
	if( attr == 0xbf )	return TRUE;
	else				return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：グッズ・金の盾・銀の盾
//＜返値＞	TRUE	はい
// 			FALSE	いいえ
//-------------------------------------------------------------------------
u8 ATR_IsBaseTateCheck( u8 attr )
{
	if( attr == 0xc4 )	return TRUE;
	else				return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：自宅パソコン
//＜返値＞	TRUE	はい
// 			FALSE	いいえ
//-------------------------------------------------------------------------
u8 ATR_IsMyRoomPCCheck( u8 attr )
{
	if( attr == 0xc5 )	return TRUE;
	else				return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：波紋がでるばしょかどうか
//＜返値＞	TRUE	出る
// 			FALSE	出ない
//-------------------------------------------------------------------------
u8 ATR_HamonCheck(u8 attr)
{
	if( attr == 0x10 || attr == 0x16 || attr == 0x14 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：水溜りかどうか
//＜返値＞	TRUE	水溜りである
// 			FALSE	違う
//-------------------------------------------------------------------------
u8 ATR_PoolCheck(u8 attr)
{
	if( attr == 0x16 )
		return TRUE;

	return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：短い草かどうか
//＜返値＞	TRUE	短い草である
// 			FALSE	違う
//-------------------------------------------------------------------------
u8 ATR_ShortGrassCheck(u8 attr)
{
	if( attr == 0x02 )
		return TRUE;

	return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：長い草かどうか
//＜返値＞	TRUE	長い草である
// 			FALSE	違う
//-------------------------------------------------------------------------
u8 ATR_LongGrassCheck(u8 attr)
{
	if( attr == 0x03 )
		return TRUE;

	return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：タネを植えられるかどうか
//	＜戻り値＞	TRUE	植えられる
//				FALSE	植えられない
//-------------------------------------------------------------------------
u8 ATR_SeedBedCheck(u8 attr)
{
	if( attr == 0xa0 )
		return TRUE;
	else
		return FALSE;
}


//-------------------------------------------------------------------------
//	マップアトリビュートチェック：火山灰（草）かどうか
//	＜戻り値＞	TRUE	火山灰（草）である
//				FALSE	そうでない
//-------------------------------------------------------------------------
u8 ATR_AshGrassCheck(u8 attr)
{
	if( attr == 0x24 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：火山灰（地面）かどうか
//	＜戻り値＞	TRUE	火山灰（地面）である
//				FALSE	そうでない
//-------------------------------------------------------------------------
u8 ATR_AshGroundCheck(u8 attr)
{
	if( attr == 0x25 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：橋かどうか
//	＜戻り値＞	TRUE	橋である
//				FALSE	そうでない
//-------------------------------------------------------------------------
u8 ATR_BridgeCheck(u8 attr)
{
	if( 0x70 <= attr && attr <= 0x73 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：橋の高さコード取得
//	＜戻り値＞	1～3	橋の高さ
//				0		橋以外
//-------------------------------------------------------------------------
u8 ATR_GetBridgeCode(u8 attr)
{
	if( attr >= 0x70 && attr <= 0x73 )
		return attr - 0x70;
	else
		return 0;
}
	

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：地面のエンカウントチェック
//	＜戻り値＞	TRUE	エンカウントする
//				FALSE	エンカウントしない
//-------------------------------------------------------------------------
u8 ATR_GroundEncountCheck(u8 attr)
{
	if (ATR_IsWaterCheck(attr) == FALSE &&
			ATR_EncountCheck(attr) == TRUE)
		return TRUE;
	else
		return FALSE;
}


//-------------------------------------------------------------------------
//	マップアトリビュートチェック：水のエンカウントチェック
//	＜戻り値＞	TRUE	エンカウントする
//				FALSE	エンカウントしない
//-------------------------------------------------------------------------
u8 ATR_WaterEncountCheck(u8 attr)
{
	if (ATR_IsWaterCheck(attr) == TRUE &&
			ATR_EncountCheck(attr) == TRUE)
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：屋内のエンカウント
//	※マップ分類がCAVEのマップ内で、洞窟か人工物かを判別するのに使用
//	＜戻り値＞	TRUE	屋内
//				FALSE	屋内でない
//-------------------------------------------------------------------------
u8 ATR_InDoorEncountCheck(u8 attr)
{
	if (attr == 0x0b)
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：岩場かどうか
//	※エンカウントなどのない場所だが戦闘背景が岩タイプになる
//	＜戻り値＞	TRUE	岩場
//				FALSE	岩場でない
//-------------------------------------------------------------------------
u8 ATR_IsRockCheck(u8 attr)
{
	if (attr == 0x0c)
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：深い水域かどうか
//	<返値>	TRUE	深い水域
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsDeepWaterCheck(u8 attr)
{
	if( attr == 0x11 || attr == 0x12 || attr == 0x14 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：浮上禁止かどうか
//	<返値>	TRUE	浮上禁止
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_DisableFloatCheck(u8 attr)
{
	if ( attr == 0x19 || attr == 0x2a )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：浅瀬かどうか
//	<返値>	TRUE	浅瀬
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_ShoalCheck(u8 attr)
{
	if( attr == 0x17 || attr == 0x1b || attr == 0x1c)
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：割れる氷かどうか
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsTrapIceCheck( u8 attr )
{
	if( attr == 0x26 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：ひびの入った氷かどうか
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsCrackedIceCheck( u8 attr )
{
	if( attr == 0x27 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：海かどうか
//	<返値>	TRUE	海です
//			FALSE	それ以外
//	※水中かどうかまでは判断できない
//-------------------------------------------------------------------------
u8 ATR_IsSeaCheck( u8 attr )
{
	if ( attr == 0x15 || attr == 0x11 || attr == 0x12 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：海と陸地の境目かどうか
//	<返値>	TRUE	そうです
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsLandSeaBorder( u8 attr )
{
	if( attr == 0x18 || attr == 0x1a )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：釣りが出来る場所かどうか
//	<返値>	TRUE	出来る
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsFishingPlace( u8 attr )
{
	if( ATR_IsWaterCheck(attr) && ATR_IsWaterFallCheck(attr) == FALSE )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：右方向へ移動不可
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsBadMoveRightCheck( u8 attr )
{
	if( attr == 0x30 || attr == 0x34 || attr == 0x36 || attr == 0xc1 || attr == 0xbe )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：左方向へ移動不可
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsBadMoveLeftCheck( u8 attr )
{
	if( attr == 0x31 || attr == 0x35 || attr == 0x37 || attr == 0xc1 || attr == 0xbe )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：上方向へ移動不可
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsBadMoveUpCheck( u8 attr )
{
	if( attr == 0x32 || attr == 0x34 || attr == 0x35 || attr == 0xc0 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：下方向へ移動不可
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsBadMoveDownCheck( u8 attr )
{
	if( attr == 0x33 || attr == 0x36 || attr == 0x37 || attr == 0xc0 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：小さい草かどうか
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsSmallGrassCheck( u8 attr )
{
	if( attr == 0x07 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：温泉かどうか
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsOnsenCheck( u8 attr )
{
	if( attr == 0x28 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：滝かどうか
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsWaterFallCheck( u8 attr )
{
	if( attr == 0x13 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：つり橋かどうか
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsHangBridgeCheck( u8 attr )
{
	if ( attr == 0x78 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：縦丸太（上側）
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsLogBridgeUpCheck( u8 attr )
{
	if ( attr == 0x74 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：縦丸太（下側）
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsLogBridgeDownCheck( u8 attr )
{
	if ( attr == 0x75 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：横丸太（左側）
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsLogBridgeLeftCheck( u8 attr )
{
	if ( attr == 0x76 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：横丸太（右側）
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsLogBridgeRightCheck( u8 attr )
{
	if ( attr == 0x77 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：丸太かどうか
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsLogBridgeCheck( u8 attr )
{
	if ( 0x74 <= attr && attr <= 0x77 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：合い言葉ゲート
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsKarakuriGateCheck( u8 attr )
{
	if ( attr == 0x8c )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：タウンマップ
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsTownMapCheck( u8 attr )
{
	if ( attr == 0x85 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：入れないドア
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsLockedDoorCheck( u8 attr )
{
	if ( attr == 0x8b )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：ルーレット
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsRouletteCheck( u8 attr )
{
	if ( attr == 0x8a )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：キューブ置き場
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsCubeTableCheck( u8 attr )
{
	if ( attr == 0x87 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：ｼﾞｬﾝﾋﾟﾝｸﾞﾏｯﾄ
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsJumpingMatCheck( u8 attr )
{
	if ( attr == 0xbb )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：くるっとﾏｯﾄ
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsTurnMatCheck( u8 attr )
{
	if ( attr == 0xbc )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：間欠泉
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsGayserCheck( u8 attr )
{
	if ( attr == 0x29 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：隠れ落とし穴
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsHidePitFallCheck( u8 attr )
{
	if ( attr == 0x68 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：ワープ
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsWarpCheck( u8 attr )
{
	if ( attr == 0x67 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：波乗り開始可能後ｱﾄﾘﾋﾞｭｰﾄ
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsNaminoriStartCheck( u8 attr )
{
	if( attr == 0x10 || attr == 0x15 ||
		attr == 0x11 || attr == 0x12 || attr == 0x14 ||
		(attr >= 0x50 && attr <= 0x53) )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：落とし穴
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsPitFallCheck(u8 attr)
{
	if (attr == 0x0f)
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：壊れた床
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsBrokenFloorCheck( u8 attr )
{
	if ( attr == 0x66 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：壊れる床
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsCrackedFloorCheck( u8 attr )
{
	if ( attr == 0xd2 )
		return TRUE;
	else 
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：すべる坂道
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsSlipSlopeCheck( u8 attr )
{
	if ( attr == 0xd0 )
		return TRUE;
	else 
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：飛び石
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsJumpStoneCheck( u8 attr )
{
	if ( attr == 0xd1 )
		return TRUE;
	else 
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：縦板
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsVBoardCheck( u8 attr )
{
	if ( attr == 0xd3 )
		return TRUE;
	else 
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：横板
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsHBoardCheck( u8 attr )
{
	if ( attr == 0xd4 )
		return TRUE;
	else 
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：縦一本橋
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsVBridgeCheck( u8 attr )
{
	if ( attr == 0xd5 )
		return TRUE;
	else 
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：横一本橋
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsHBridgeCheck( u8 attr )
{
	if ( attr == 0xd6 )
		return TRUE;
	else 
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：海藻
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsSeaWeedCheck( u8 attr )
{
	if ( attr == 0x22 || attr == 0x2a )
		return TRUE;
	else 
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：自転車移動不可かどうか
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsCycleBatMoveCheck( u8 attr )
{
	if (
			attr == 0x0a					// 自転車にのれない地面
			|| attr == 0x03					// 長い草
			|| attr == 0x28					// 温泉
			|| ATR_IsLogBridgeCheck(attr)	// 丸太
			)
		return TRUE;
	else 
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：居合い斬りで斬れる草かどうか
//＜返値＞	TRUE	斬れる
// 			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsIaiGrassCheck( u8 attr )
{
	if( attr == 0x02 || attr == 0x03 || attr == 0x24 || attr == 0x09 )
			return TRUE;
	else
			return FALSE;
};

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：ノート(ダッシュ)
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsDashNoteCheck( u8 attr )
{
	if ( attr == 0x8e )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：本棚１
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsBookRack1Check( u8 attr )
{
	if ( attr == 0xe0 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：本棚２
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsBookRack2Check( u8 attr )
{
	if ( attr == 0xe1 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：本棚３
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsBookRack3Check( u8 attr )
{
	if ( attr == 0xe2 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：つぼ
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsPotCheck( u8 attr )
{
	if ( attr == 0xe3 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：ゴミ箱
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsTrashBoxCheck( u8 attr )
{
	if ( attr == 0xe4 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：デパート・ショップの棚
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsGlassCaseCheck( u8 attr )
{
	if ( attr == 0xe5 )
		return TRUE;
	else
		return FALSE;
}

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：設計図
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsBluePrintCheck( u8 attr )
{
	if ( attr == 0xe6 )
		return TRUE;
	else
		return FALSE;
}

