
//=========================================================================
//	
//=========================================================================

#ifndef MAP_ATTR_H
#define MAP_ATTR_H
#undef GLOBAL
#ifdef MAP_ATTR_H_GLOBAL
#define GLOBAL /*	*/
#else
#define GLOBAL extern
#endif

//=========================================================================
//	定義
//=========================================================================
//#define name value


//typedef ...


//=========================================================================
//	変数
//=========================================================================
//GLOBAL type valiable;


//=========================================================================
//	関数プロトタイプ
//=========================================================================
//GLOBAL type function(arg...);

//#########################################################################
//	マップアトリビュートチェックについて
//	※すべてのマップアトリビュートチェック関数は、
//	・ATR_～の関数名を持つ。
//	・引数としてアトリビュートコードattrを渡す。
//	・返値として条件に適合するときはTRUE,それ以外のときはFALSEを返す。
//#########################################################################

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：歩けるかどうか
//＜返値＞	TRUE	歩ける
// 			FALSE	歩けない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_WalkEnableCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：右方向にジャンプするかどうか
//＜返値＞	TRUE	ジャンプできる
// 			FALSE	ジャンプできない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_JumpRightEnableCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：左方向にジャンプするかどうか
//＜返値＞	TRUE	ジャンプできる
// 			FALSE	ジャンプできない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_JumpLeftEnableCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：上方向にジャンプするかどうか
//＜返値＞	TRUE	ジャンプできる
// 			FALSE	ジャンプできない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_JumpUpEnableCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：下方向にジャンプするかどうか
//＜返値＞	TRUE	ジャンプできる
// 			FALSE	ジャンプできない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_JumpDownEnableCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：砂アトリビュートかどうか
//	<返値>	TRUE	砂
//			FALSE	砂以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsSandCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：深い砂アトリビュートかどうか
//	<返値>	TRUE	深い砂
//			FALSE	深い砂以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsDeepSandCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：草むらかどうかのチェック
//＜返値＞	TRUE	草の場所
// 			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsGrassCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：映り込みするアトリビュートかどうか
//	<返値>	TRUE	映り込みする
//			FALSE	映り込みしない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsReflectCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：映り込み氷アトリビュートかどうか
//	<返値>	TRUE	映り込み氷
//			FALSE	氷ではない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsReflectIceCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：ドアのアトリビュートかどうか
//	<返値>	TRUE	ドア
//			FALSE	ドア以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsDoorCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：ドアのエフェクトが有効かどうか
//	<返値>	TRUE	有効
//			FALSE	有効でない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_DoorEffectCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：エスカレーターかどうか
//	<返値>	TRUE	エスカレーター
//			FALSE	エスカレーター以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsEscalatorCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：斬れる木のアトリビュートかどうか
//	<返値>	TRUE	斬れる木
//			FALSE	斬れる木以外
//-------------------------------------------------------------------------
GLOBAL	u8 ATR_IsTreeCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：はしごのアトリビュートかどうか
//	<返値>	TRUE	はしご
//			FALSE	はしご以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsLadderCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：壁の出入口のアトリビュートかどうか
//	<返値>	TRUE	壁の出入り口
//			FALSE	壁の出入り口以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsWallExitCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：壁の出入口上方向のアトリビュートかどうか
//	<返値>	TRUE	壁の出入り口
//			FALSE	壁の出入り口以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsWallExitUpCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：水アトリビュートかどうか
//	<返値>	TRUE	水
//			FALSE	水以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsWaterCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：海かどうか
//	<返値>	TRUE	海です
//			FALSE	それ以外
//	※水中かどうかまでは判断できない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsSeaCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：右方向に出るマットかどうか
//	<返値>	TRUE	マット
//			FALSE	マット以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_ExitMatRightEnableCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：左方向に出るマットかどうか
//	<返値>	TRUE	マット
//			FALSE	マット以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_ExitMatLeftEnableCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：上方向に出るマットかどうか
//	<返値>	TRUE	マット
//			FALSE	マット以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_ExitMatUpEnableCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：下方向に出るマットかどうか
//	<返値>	TRUE	マット
//			FALSE	マット以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_ExitMatDownEnableCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：マットかどうか
//	<返値>	TRUE	マット
//			FALSE	マット以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_ExitMatEnableCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：頭突きの木のアトリビュートかどうか
//	<返値>	TRUE	頭突きの木
//			FALSE	頭突きの木以外
//-------------------------------------------------------------------------
GLOBAL	u8 ATR_IsZutukiTreeCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：強制移動地形かどうか
//	<返値>	TRUE	そうです
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsForceMoveCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：すべるフロアかどうか(氷)
//	<返値>	TRUE	すべる
//			FALSE	すべらない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsSlipFloorIceCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：すべるフロアかどうか(室内床)
//	<返値>	TRUE	すべる
//			FALSE	すべらない
//-------------------------------------------------------------------------
u8 ATR_IsSlipFloorRoomCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：上方向に強制移動するかどうか
//	<返値>	TRUE	強制移動する
//			FALSE	強制移動しない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsUpForceMoveCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：下方向に強制移動するかどうか
//	<返値>	TRUE	強制移動する
//			FALSE	強制移動しない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsDownForceMoveCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：左方向に強制移動するかどうか
//	<返値>	TRUE	強制移動する
//			FALSE	強制移動しない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsLeftForceMoveCheck(u8 attr);


//-------------------------------------------------------------------------
//	マップアトリビュートチェック：上方向に強制移動 海流
//	<返値>	TRUE	強制移動する
//			FALSE	強制移動しない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsUpForceMoveCurrentCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：下方向に強制移動 海流
//	<返値>	TRUE	強制移動する
//			FALSE	強制移動しない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsDownForceMoveCurrentCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：左方向に強制移動 海流
//	<返値>	TRUE	強制移動する
//			FALSE	強制移動しない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsLeftForceMoveCurrentCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：右方向に強制移動 海流
//	<返値>	TRUE	強制移動する
//			FALSE	強制移動しない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsRightForceMoveCurrentCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：右方向に強制移動するかどうか
//	<返値>	TRUE	強制移動する
//			FALSE	強制移動しない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsRightForceMoveCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：上方向に方向固定のまま強制移動するかどうか
//	<返値>	TRUE	強制移動する
//			FALSE	強制移動しない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsUpForcePushCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：下方向に方向固定のまま強制移動するかどうか
//	<返値>	TRUE	強制移動する
//			FALSE	強制移動しない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsDownForcePushCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：左方向に方向固定のまま強制移動するかどうか
//	<返値>	TRUE	強制移動する
//			FALSE	強制移動しない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsLeftForcePushCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：右方向に方向固定のまま強制移動するかどうか
//	<返値>	TRUE	強制移動する
//			FALSE	強制移動しない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsRightForcePushCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：1セル向こうに話かけられるかどうか
//＜返値＞	TRUE	できる
// 			FALSE	できない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsCounterCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：ＴＶかどうか
//＜返値＞	TRUE	ＴＶである
// 			FALSE	違う
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsTVCheck(u8 attr, u8 site);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：パソコンかどうか
//＜返値＞	TRUE	パソコン
// 			FALSE	違う
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsPasoCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：対戦表かどうか
//＜返値＞	TRUE	対戦表
// 			FALSE	違う
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsScoreBoardCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：秘密基地の入り口かどうか
//＜返値＞	TRUE	入り口
// 			FALSE	入り口以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsBaseDoorCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：スコップで秘密基地が作れるか
//＜返値＞	TRUE	作れる
// 			FALSE	作れない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsMakeScoopBaseCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：ロープで秘密基地が作れるか
//＜返値＞	TRUE	作れる
// 			FALSE	作れない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsMakeRopeBaseCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：カマで秘密基地が作れるか
//＜返値＞	TRUE	作れる
// 			FALSE	作れない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsMakeKamaBaseCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：秘密の箱か
//＜返値＞	TRUE	箱
// 			FALSE	箱以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsBaseSecretBoxCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：グッズ交換箱か
//＜返値＞	TRUE	箱
// 			FALSE	箱以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsGoodsChangeBoxCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：基地の掲示板か
//＜返値＞	TRUE	掲示板
// 			FALSE	掲示板以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsBaseBoardCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：お留守番キャラの表示位置か
//＜返値＞	TRUE	表示位置
// 			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsBaseCharCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：歩けない場所でお留守番キャラが置けない
//＜返値＞	TRUE	表示位置
// 			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsBaseNoWalkCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：床にグッズが置けるか
//＜返値＞	TRUE	置ける
// 			FALSE	置けない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsGoodsPutFloorCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：壁にグッズが置けるか
//＜返値＞	TRUE	置ける
// 			FALSE	置けない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsGoodsPutWallCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：グッズは置けないが歩ける場所か
//＜返値＞	TRUE	はい
// 			FALSE	いいえ
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsGoodsNotPutWalkCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：グッズの上にグッズが置けるか
//＜返値＞	TRUE	置ける
// 			FALSE	置けない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsGoodsPutGoodsCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：大きいぬいぐるみが置ける場所か
//＜返値＞	TRUE	置ける
// 			FALSE	置けない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsBigDollPutCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：丈夫な板が置ける場所か
//＜返値＞	TRUE	置ける
// 			FALSE	置けない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsGoodsPutIta( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：グッズ・水風船＆泥団子
//＜返値＞	TRUE	はい
// 			FALSE	いいえ
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsBreakGoodsCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：グッズ・つきやぶれるドア
//＜返値＞	TRUE	はい
// 			FALSE	いいえ
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsBaseBreakDoorCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：グッズ・音マット
//＜返値＞	TRUE	はい
// 			FALSE	いいえ
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsBaseSoundMatCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：グッズ・真っ暗マット
//＜返値＞	TRUE	はい
// 			FALSE	いいえ
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsBaseDarkMatCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：グッズ・砂の置物
//＜返値＞	TRUE	はい
// 			FALSE	いいえ
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsBaseSndObjCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：グッズ・金の盾・銀の盾
//＜返値＞	TRUE	はい
// 			FALSE	いいえ
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsBaseTateCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：自宅パソコン
//＜返値＞	TRUE	はい
// 			FALSE	いいえ
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsMyRoomPCCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：波紋がでるばしょかどうか
//＜返値＞	TRUE	出る
// 			FALSE	出ない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_HamonCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：水溜りかどうか
//＜返値＞	TRUE	出る
// 			FALSE	出ない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_PoolCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：短い草かどうか
//＜返値＞	TRUE	短い草
// 			FALSE	違う
//-------------------------------------------------------------------------
GLOBAL u8 ATR_ShortGrassCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：長い草かどうか
//＜返値＞	TRUE	長い草
// 			FALSE	違う
//-------------------------------------------------------------------------
GLOBAL u8 ATR_LongGrassCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：タネを植えられるかどうか
//	＜戻り値＞	TRUE	植えられる
//				FALSE	植えられない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_SeedBedCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：火山灰（草）かどうか
//	＜戻り値＞	TRUE	火山灰（草）である
//				FALSE	そうでない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_AshGrassCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：火山灰（地面）かどうか
//	＜戻り値＞	TRUE	火山灰（地面）である
//				FALSE	そうでない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_AshGroundCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：橋かどうか
//	＜戻り値＞	TRUE	橋である
//				FALSE	そうでない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_BridgeCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：橋の高さコード取得
//	＜戻り値＞	1～3	橋の高さ
//				0		橋以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_GetBridgeCode(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：地面のエンカウントチェック
//	＜戻り値＞	TRUE	エンカウントする
//				FALSE	エンカウントしない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_GroundEncountCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：水のエンカウントチェック
//	＜戻り値＞	TRUE	エンカウントする
//				FALSE	エンカウントしない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_WaterEncountCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：屋内のエンカウント
//	※マップ分類がCAVEのマップ内で、洞窟か人工物かを判別するのに使用
//	＜戻り値＞	TRUE	屋内
//				FALSE	屋内でない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_InDoorEncountCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：岩場かどうか
//	※エンカウントなどのない場所だが戦闘背景が岩タイプになる
//	＜戻り値＞	TRUE	岩場
//				FALSE	岩場でない
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsRockCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：深い水域かどうか
//	<返値>	TRUE	深い水域
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsDeepWaterCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：浮上禁止かどうか
//	<返値>	TRUE	浮上禁止
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_DisableFloatCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：浅瀬かどうか
//	<返値>	TRUE	浅瀬
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_ShoalCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：割れる氷かどうか
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsTrapIceCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：ひびの入った氷かどうか
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsCrackedIceCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：海と陸地の境目かどうか
//	<返値>	TRUE	そうです
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsLandSeaBorder( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：釣りが出来る場所かどうか
//	<返値>	TRUE	出来る
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsFishingPlace( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：右方向へ移動不可
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsBadMoveRightCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：左方向へ移動不可
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsBadMoveLeftCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：上方向へ移動不可
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsBadMoveUpCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：下方向へ移動不可
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsBadMoveDownCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：小さい草かどうか
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsSmallGrassCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：温泉かどうか
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsOnsenCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：滝かどうか
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsWaterFallCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：つり橋かどうか
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsHangBridgeCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：丸太かどうか
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsLogBridgeCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：縦丸太（上側）
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsLogBridgeUpCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：縦丸太（下側）
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsLogBridgeDownCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：横丸太（左側）
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsLogBridgeLeftCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：横丸太（右側）
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsLogBridgeRightCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：合い言葉ゲート
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsKarakuriGateCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：タウンマップ
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsTownMapCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：入れないドア
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsLockedDoorCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：ルーレット
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsRouletteCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：キューブ置き場
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsCubeTableCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：ｼﾞｬﾝﾋﾟﾝｸﾞﾏｯﾄ
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsJumpingMatCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：くるっとﾏｯﾄ
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsTurnMatCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：間欠泉
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsGayserCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：隠れ落とし穴
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsHidePitFallCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：ワープ
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsWarpCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：波乗り開始可能後ｱﾄﾘﾋﾞｭｰﾄ
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsNaminoriStartCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：落とし穴
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsPitFallCheck(u8 attr);

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：壊れた床
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsBrokenFloorCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：壊れる床
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsCrackedFloorCheck( u8 attr );


//-------------------------------------------------------------------------
//	マップアトリビュートチェック：すべる坂道
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsSlipSlopeCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：飛び石
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsJumpStoneCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：縦板
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsVBoardCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：横板
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsHBoardCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：縦一本橋
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsVBridgeCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：横一本橋
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsHBridgeCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：海藻
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsSeaWeedCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：自転車移動不可かどうか
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
u8 ATR_IsCycleBatMoveCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：居合い斬りで斬れる草かどうか
//＜返値＞	TRUE	斬れる
// 			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsIaiGrassCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：ノート(ダッシュ)
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsDashNoteCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：本棚１
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsBookRack1Check( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：本棚２
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsBookRack2Check( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：本棚３
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsBookRack3Check( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：つぼ
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsPotCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：ゴミ箱
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsTrashBoxCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：デパート・ショップの棚
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsGlassCaseCheck( u8 attr );

//-------------------------------------------------------------------------
//	マップアトリビュートチェック：設計図
//	<返値>	TRUE	そうです。
//			FALSE	それ以外
//-------------------------------------------------------------------------
GLOBAL u8 ATR_IsBluePrintCheck( u8 attr );

#undef GLOBAL
#endif	/*MAP_ATTR_H*/

