//===============================================================
//
//	メッセージデータ
//
//	2002 GAME FREAK Inc.
//===============================================================


// フォント定義ヘッダ
#include "fntequ.h"
#include "i_msg.ndw"

//===============================================================
//	メッセージデータ本体
//===============================================================

	.GLOBAL	msg_sample_data
msg_sample_data:
	.byte	EOM_

#include "../msgdata/report.mes"
#include "../msgdata/opening.mes"


