//========================================================================================
//									　移動ポケモン
//								　2002/06/24 by nakahiro
//========================================================================================
#ifndef	_MV_POKE_H
#define _MV_POKE_H

typedef struct {

	u32	pow_rnd;		// パワー乱数
	u32	personal_rnd;	// 個性乱数

	u16	no;				// ポケモンナンバー
	u16	hp;				// HP

	u8	lv;				// Lv
	u8	cond;			// 状態異常

	u8	style;			// かっこよさ
	u8	beautiful;		// うつくしさ
	u8	cute;			// かわいさ
	u8	clever;			// かしこさ
	u8	strong;			// たくましさ

	u8	encount;		// エンカウントフラグ

}MV_POKE;

#define	MvPokeData	( (MV_POKE *)&Fld.MovingPokemon )


//---------------------------------------
//	移動ポケモンデータ初期化
//---------------------------------------
extern void MvPokeDataInit(void);

//---------------------------------------
//	移動データ初期化
//---------------------------------------
extern void MvPokeMoveDataInit(void);

//---------------------------------------
//	移動ポケモンセット
//---------------------------------------
extern void AddMovePokeData(void);
extern void AddMvPoke(void);

//---------------------------------------
//	主人公の移動情報セット
//---------------------------------------
extern void MvPokeHeroPosSet(void);

//---------------------------------------
//	ポケモン移動（ランダム）
//---------------------------------------
extern void MvPokeMoveRnd(void);

//---------------------------------------
//	ポケモン移動（ノーマル）
//---------------------------------------
extern void MvPokeMove(void);

//---------------------------------------
//	移動ポケモンエンカウントチェック
//	戻り値 : TRUE  = ENCOUNT
//			 FALSE = NOT ENCOUNT
//---------------------------------------
extern u8 MvPokeEncount(void);

//---------------------------------------
//	戦闘終了後にパラメータを取得
//	引数 : pp = 敵データ
//---------------------------------------
extern void GetMovePokeParam( PokemonParam * pp );

//---------------------------------------
//	エンカウントフラグを下げる
//---------------------------------------
extern void MvPokeFlagReset(void);

//---------------------------------------
//	現在地を取得
//	u8 * div = DIV_ID を保存
//	u8 * map = MAP_ID を保存
//---------------------------------------
extern void MvPokeNowPosGet( u8 * div, u8 * map );



#endif	// _MV_POKE_H
