/*==================================================================*/
/*                  pic_chr.c                                       */
/*             　　 画像エフェクトキャラクター化部分                */
/*                  by tomo                                         */
/*==================================================================*/

/*==================================================================*/
/*                      INCLUDE FILE                                */
/*==================================================================*/
#include "common.h"
#include "intr.h"
#include "print.h"
#include "calctool.h"
#include "menu.h"
#include "palanm.h"
#include "actanm.h"
#include "objdata.h"
#include "decord.h"
#include "pic_eff.h"

/*==================================================================*/
/*==================================================================*/
//extern void effect_pal_trans(BE_ST *est);

/*==================================================================*/
/*                      関数宣言                                    */
/*==================================================================*/
//void poke_bit_to_bg(BE_ST *est);
void poke_bit_to_obj(BE_ST *est);

/*==================================================================*/
/*                      内部関数宣言                                */
/*==================================================================*/

/*==================================================================*/
/*                      define,typedef等                            */
/*==================================================================*/

/*==================================================================*/
/*                       変数                                       */
/*==================================================================*/

#if 0
//poke_bit_color_down()で256色化したデータを
//BGデータ(character&map)に変換してセットします。
//※パレットのセットも行います。
//※mode=(0,1,3)は256色モードですので、16色出力(out_mode=1)はできません。
//ＸＹＷＨ全て、8の倍数前提です。
void poke_bit_to_bg(BE_ST *est)
{
	u16 i,j,k;
	u16 q,r,s;
	u16 *bp,*bp2;
	u8 *cp,*cp2;
	u16 yb,xb;

	effect_pal_trans(est);		//パレットセット

	bp = est->bg_adrs;
	cp = est->chr_adrs;

	xb = (est->sah) / 8;		//横ドット数
	yb = (est->sav) / 8;		//縦ドット数

	//map set

	k=0;
	if(est->out_mode == 0){		//２５６色
		for(j=0;j<yb;j++) {
			for(i=0;i<xb;i++,k++) {
				*(est->map_adrs + j*32 + i) = k;
			}
		}
	}else{						//１６色（パレット指定あり）
		for(j=0;j<yb;j++) {
			for(i=0;i<xb;i++,k++) {
				*(est->map_adrs + j*32 + i) = k | ((est->pal_p)<<12);
			}
		}
	}

	//char set

	if(est->out_mode == 0){		//２５６色
		for(s=0;s<yb;s++){					//Yblock
			for(r=0;r<xb;r++){				//Xblock
				for(q=0;q<8;q++){				//Ychar
					//Xchar 8dot==4word
					cp2 = (u8 *)(cp + (s*xb + r)*64 + (q*8));
					bp2 = (u16 *)(bp + (s*8+q)*(8*xb) + (r*8));

					*((u16 *)(cp2+0)) = ((*(bp2+0+0))<<0) | ((*(bp2+0+1))<<8);
					*((u16 *)(cp2+2)) = ((*(bp2+2+0))<<0) | ((*(bp2+2+1))<<8);
					*((u16 *)(cp2+4)) = ((*(bp2+4+0))<<0) | ((*(bp2+4+1))<<8);
					*((u16 *)(cp2+6)) = ((*(bp2+6+0))<<0) | ((*(bp2+6+1))<<8);
				}
			}
		}
	}else{						//１６色（パレット指定あり）
		for(s=0;s<yb;s++){					//Yblock
			for(r=0;r<xb;r++){				//Xblock
				for(q=0;q<8;q++){				//Ychar
					//Xchar 8dot==2word
					cp2 = (u8 *)(cp + (s*xb + r)*32 + (q*4));
					bp2 = (u16 *)(bp + (s*8+q)*(8*xb) + (r*8));

					*((u16 *)(cp2+0)) =	((*(bp2+0+0))<<0) | ((*(bp2+0+1))<<4) |
										((*(bp2+0+2))<<8) | ((*(bp2+0+3))<<12);
					*((u16 *)(cp2+2)) =	((*(bp2+4+0))<<0) | ((*(bp2+4+1))<<4) |
										((*(bp2+4+2))<<8) | ((*(bp2+4+3))<<12);
				}
			}
		}
	}
}

#endif

/*==================================================================*/
/*==================================================================*/
//poke_bit_color_down()で256色化したデータを
//OBJデータ(character)に変換してセットします(64*64dotまで対応)。
//ＸＹＷＨ全て、8の倍数前提です。
//表示は６４＊６４ドットＯＢＪ固定(それ以下の場合も拡張）
void poke_bit_to_obj(BE_ST *est)
{
	u16 q,r,s;
	u16 *bp,*bp2;
	u8 *cp,*cp2;
	u16 yb,xb;

#if 0		//02/09/01 直接パレットを送るとバグになるので外しました。
	effect_pal_trans(est);		//パレットセット
#endif

	xb = (est->sah) / 8;		//横ドット数
	yb = (est->sav) / 8;		//縦ドット数

	bp = est->bg_adrs;
	cp = est->chr_adrs;

	//char set

	if(est->out_mode == 2){		//２５６色
		for(s=0;s<yb;s++){					//Yblock
			for(r=0;r<xb;r++){				//Xblock
				for(q=0;q<8;q++){				//Ychar
					//Xchar 8dot==4word
					cp2 = (u8 *)(cp + (s*xb + r)*64 + (q*8));
					bp2 = (u16 *)(bp + (s*8+q)*(8*xb) + (r*8));

					*((u16 *)(cp2+0)) = ((*(bp2+0+0))<<0) | ((*(bp2+0+1))<<8);
					*((u16 *)(cp2+2)) = ((*(bp2+2+0))<<0) | ((*(bp2+2+1))<<8);
					*((u16 *)(cp2+4)) = ((*(bp2+4+0))<<0) | ((*(bp2+4+1))<<8);
					*((u16 *)(cp2+6)) = ((*(bp2+6+0))<<0) | ((*(bp2+6+1))<<8);
				}
			}
		}
	}else{						//１６色（パレット指定あり）
		for(s=0;s<yb;s++){					//Yblock
			for(r=0;r<xb;r++){				//Xblock
				for(q=0;q<8;q++){				//Ychar
					//Xchar 8dot==2word
					cp2 = (u8 *)(cp + (s*xb + r)*32 + (q*4));
					bp2 = (u16 *)(bp + (s*8+q)*(8*xb) + (r*8));

					*((u16 *)(cp2+0)) =	((*(bp2+0+0))<<0) | ((*(bp2+0+1))<<4) |
										((*(bp2+0+2))<<8) | ((*(bp2+0+3))<<12);
					*((u16 *)(cp2+2)) =	((*(bp2+4+0))<<0) | ((*(bp2+4+1))<<4) |
										((*(bp2+4+2))<<8) | ((*(bp2+4+3))<<12);
				}
			}
		}
	}
}

/*==================================================================*/
/*==================================================================*/
