
//=========================================================================
//	
//	プレイ時間関連
//
//=========================================================================

#ifndef PLAYTIME_H
#define PLAYTIME_H

#undef GLOBAL
#ifdef PLAYTIME_H_GLOBAL
#define GLOBAL /*	*/
#else
#define GLOBAL extern
#endif

//=========================================================================
//	定義
//=========================================================================
//#define name value
//
#define PLAYTIME_H_MAX	1000	/* 最大プレイ時間 */


//typedef ...


//=========================================================================
//	変数
//=========================================================================
//GLOBAL type valiable;


//=========================================================================
//	関数プロトタイプ
//=========================================================================
//GLOBAL type function(arg...);
GLOBAL void PlayTimeInit(void);		// プレイ時間初期化
GLOBAL void PlayTimeStart(void);	// プレイ時間カウントスタート
GLOBAL void PlayTimeStop(void);		// プレイ時間カウントストップ
GLOBAL void PlayTimeCount(void);	// プレイ時間カウントルーチン



#undef GLOBAL
#endif	/*PLAYTIME_H*/

