#ifndef __PM_AFF_H__
#define __PM_AFF_H__

//----------------------------------------------------------
//	ｱﾌｨﾝﾃｰﾌﾞﾙﾅﾝﾊﾞｰ(味方ﾎﾟｹﾓﾝ用)
//----------------------------------------------------------
enum{
	PAB_NORMAL = 0,
	PAB_BALLOUT,
	PAB_BALLIN,
	PAB_HASAMU,
	PAB_SEITYOUUP,
	PAB_SEITYOUDOWN,
	PAB_HUKITOBASIUP,
	PAB_ZUTUKIR,
	PAB_TIISAKUNARU,
};

//----------------------------------------------------------
//	ｱﾌｨﾝﾃｰﾌﾞﾙﾅﾝﾊﾞｰ(敵ﾎﾟｹﾓﾝ用)
//----------------------------------------------------------
enum{
	PAF_NORMAL = 0,
	PAF_BALLOUT,
	PAF_BALLIN,
	PAF_HASAMU,
	PAF_SEITYOUUP,
	PAF_SEITYOUDOWN,
	PAF_HUKITOBASIDOWN,
	PAF_ZUTUKIL,
	PAF_ATEMINAGE,
	PAF_TIISAKUNARU,
	PAF_JIGOKUGURUMA
};


//=========================================================================
//	その他の定数
//=========================================================================

//----------------------------------------------------------
//	ポケモンの標準AFFINE値(後ろ向き)
//----------------------------------------------------------
#define POKE_DEFA_AFFINE	0x100

//----------------------------------------------------------
//	ﾎﾞｰﾙから出てくるときのﾎﾟｹﾓﾝの最初の縮小率
//----------------------------------------------------------
#define PBL_OUT_SP		18		//1回のﾙｰﾌﾟで拡大する数
#define PBL_OUT_LOOP	12		//ﾙｰﾌﾟ回数
#define PBL_OUT_AFF	(POKE_DEFA_AFFINE - (PBL_OUT_SP * PBL_OUT_LOOP)) //ﾎﾟｹﾓﾝの最初の縮小率
//----------------------------------------------------------
//	ﾎﾞｰﾙに入るときのﾎﾟｹﾓﾝの縮小
//----------------------------------------------------------
#define PBL_IN_SP		(-12)	//(-PBL_OUT_SP)
#define PBL_IN_LOOP		PBL_OUT_LOOP

//----------------------------------------------------------
//	「はさむ」
//----------------------------------------------------------
#define HASAMU_SET		(0xa0)
#define HASAMU_SP		(4)
#define HASAMU_LOOP		(8)

//----------------------------------------------------------
//	「せいちょう」
//----------------------------------------------------------
#define SEITYOU_SP		(2)
#define SEITYOU_LOOP		(20)

//----------------------------------------------------------
//	「ふきとばし」
//----------------------------------------------------------
#define HUKITOBASI_SP		(4)
#define HUKITOBASI_LOOP		(63)
#define HUKITOBASI_THETA	(4)

//----------------------------------------------------------
//	「ずつき」
//----------------------------------------------------------
#define ZUTUKI_LOOP		(5)
#define ZUTUKI_THETA	(3)

//----------------------------------------------------------
//	「あてみなげ」
//----------------------------------------------------------
#define ATEMINAGE_LOOP		(20)
#define ATEMINAGE1_THETA	(5)
#define ATEMINAGE2_THETA	(-5)

//----------------------------------------------------------
//	「じごくぐるま」
//----------------------------------------------------------
#define JIGOKUGURUMA_LOOP	110
#define JIGOKUGURUMA_THETA	(255 * 4 / JIGOKUGURUMA_LOOP)


#endif	__PM_AFF_H__
