#ifndef __POKESCR_H__
#define __POKESCR_H__

//=========================================================================
//
//		ポケモン関連スクリプト関数
//			※全てスクリプト/イベントから呼ばれる事が前提
//														by matsuda
//=========================================================================

#undef GLOBAL
#ifdef __POKESCR_H_GLOBAL__
#define GLOBAL /*	*/
#else
#define GLOBAL extern
#endif

//=========================================================================
//	関数プロトタイプ
//=========================================================================
//GLOBAL type function(arg...);

//----------------------------------------------------------
// 手持ちﾎﾟｹﾓﾝ全回復
//----------------------------------------------------------
GLOBAL void PokeAllKaifuku(void);

//----------------------------------------------------------
//	手持ちにポケモンを加える。手持ちがいっぱいならﾊﾟｿｺﾝに転送
//	戻り値:	0 = 手持ちに加わった
//			1 = ﾊﾟｿｺﾝに加わった
//			2 = どちらもいっぱいだった
//----------------------------------------------------------
GLOBAL u8 TemotiPokeAdd(u16 monsno, u8 lv, u16 itemno, 
		u8 *pokename_adrs, u8 *oyaname_adrs, u8 name_sw);

//----------------------------------------------------------
//	手持ちにタマゴを加える。手持ちがいっぱいならﾊﾟｿｺﾝに転送
//	戻り値:	0 = 手持ちに加わった
//			1 = ﾊﾟｿｺﾝに加わった
//			2 = どちらもいっぱいだった
//----------------------------------------------------------
GLOBAL u8 TemotiTamagoAdd(u16 monsno);

//----------------------------------------------------------
//	２対２対戦可能かどうかのチェック
//----------------------------------------------------------
GLOBAL void AnswerPoke2vs2Check(void);

//----------------------------------------------------------
//	野生ポケモンセット
//----------------------------------------------------------
GLOBAL void ScrEncountPokeSet( u16 pokeno, u8 level, u16 itemno );

//----------------------------------------------------------
//	手持ちポケモンのわざを置き換える
//----------------------------------------------------------
GLOBAL void TemotiPokeWazaChange( u8 pos, u16 wazano, u8 waza_pos );

//----------------------------------------------------------
//	選択結果によって手持ちポケモンを並び替える
//	※マルチバトルのポケモン選択用、SelectPoke[3]を参照して
//	　PokeParaMine/PokeCountMineを直接書き換える
//----------------------------------------------------------
GLOBAL void SortSelectPokemon( void );
GLOBAL void SelectBattleMonsStart( void );

//----------------------------------------------------------
//	毒ダメージの反映、死亡チェック
//	<戻り値>	0	何もなし
//				1	毒ダメージあり
//				2	だれかが瀕死
//----------------------------------------------------------
GLOBAL int PoisonDeadCheck( void );

//----------------------------------------------------------
//	おおきさオヤジの記録初期化
//----------------------------------------------------------
GLOBAL void KinokokoSizeOyajiRecordInit( void );

//----------------------------------------------------------
//	おおきさオヤジのMSG用ワークセット
//----------------------------------------------------------
GLOBAL void KinokokoSizeOyajiRecordInfoSet( void );

//----------------------------------------------------------
//	おおきさオヤジの記録初期化
//----------------------------------------------------------
GLOBAL void NamazoSizeOyajiRecordInit( void );

//----------------------------------------------------------
//	おおきさオヤジのMSG用ワークセット
//----------------------------------------------------------
GLOBAL void NamazoSizeOyajiRecordInfoSet( void );

//----------------------------------------------------------
//		外部リボンを手持ちポケモンにセット
//
//	<引数>	pos		リボン指定（0～6）
//			type	リボンの種類
//----------------------------------------------------------
GLOBAL void TemotiExtraRibbonSet( u8 pos, u8 type );

#undef GLOBAL
#endif	/*__POKESCR_H__*/

