
#ifndef __R_DOOR_H__
#define __R_DOOR_H__

//=========================================================================
//	
//=========================================================================

#undef GLOBAL
#ifdef __R_DOOR_H_GLOBAL_
#define GLOBAL /*	*/
#else
#define GLOBAL extern
#endif

//=========================================================================
//	定義
//=========================================================================
//#define name value

//typedef ...


//=========================================================================
//	変数
//=========================================================================
//GLOBAL type valiable;


//=========================================================================
//	関数プロトタイプ
//=========================================================================
//GLOBAL type function(arg...);

GLOBAL void DoorObjInit( void );				//ドアOBJパラメータ初期化
GLOBAL void DoorObjControl( s16 dx, s16 dy );	//スクロール時のドアOBJ制御
GLOBAL void DoorObjSet( void );					//マップ遷移・画面復帰時のドアOBJセット

//-------------------------------------------------------------------------
//	回転ドアとのヒットチェック
//　<引数>
//	site	移動方向
//	x		移動先Ｘ座標
//	y		移動先Ｙ座標
//
//	<戻り値>
//	0		当たりなし or 回転して進める
//	1		進めない
//-------------------------------------------------------------------------
GLOBAL int DoorPushCheck( u8 site, s16 x, s16 y );


#undef GLOBAL
#endif	/*__R_DOOR_H__*/

