#ifndef __SAVELOAD_H__
#define __SAVELOAD_H__

//=========================================================================
//
//
//	セーブロード関連
//	
//
//=========================================================================

#undef GLOBAL
#ifdef __SAVELOAD_H_GLOBAL__
#define GLOBAL /*	*/
#else
#define GLOBAL extern
#endif


//=========================================================================
//	定義
//=========================================================================

typedef enum{
		NO_MEMORY_TYPE = 0,				//フラッシュがない
		FLASH_1M_TYPE,					//1Mフラッシュあり
}SAVE_MEMORY_TYPE;


//=========================================================================
//	変数
//=========================================================================

extern SAVE_MEMORY_TYPE SaveMemType;

//=========================================================================
//	関数プロトタイプ
//=========================================================================

//-------------------------------------------------------------------------
//　セーブロードシステムの初期化
//	※FLASHを認識したらFLASHモード、それ以外はSRAMとしてセーブさせている
//	　本番ではどちらかに統一される予定
//-------------------------------------------------------------------------
GLOBAL void SaveLoadSystemInit(void);

//-------------------------------------------------------------------------
//	特殊なコンティニュー状態かどうかのチェック
//	<戻り値>	1	特殊、指定マップに遷移して開始
//				0	通常
//-------------------------------------------------------------------------
GLOBAL int CheckContinueStatus( void );

//-------------------------------------------------------------------------
//	特殊コンティニュー状態クリア
//-------------------------------------------------------------------------
GLOBAL void InitContinueStatus( void );

//-------------------------------------------------------------------------
//	特殊コンティニュー状態セット
//-------------------------------------------------------------------------
GLOBAL void SetContinueStatus( void );

//-------------------------------------------------------------------------
//	通信部屋でのセーブ時のフラグ設定
//-------------------------------------------------------------------------
GLOBAL void SetCommSaveFlag( void );
GLOBAL void ClearCommSaveFlag( void );


//-------------------------------------------------------------------------
//	手持ちポケモンデータの退避・復帰
//-------------------------------------------------------------------------
GLOBAL void BackUpPokeParaMine( void );
GLOBAL void RecoverPokeParaMine( void );

GLOBAL void BackUpGameData( void );
GLOBAL void RecoverGameData( void );

//-------------------------------------------------------------------------
//	手持ちのどうぐを退避
//-------------------------------------------------------------------------
GLOBAL void BackUpTemotiItem(void);
GLOBAL void RecoverTemotiItem(void);

#undef GLOBAL
#endif	/*__SAVELOAD_H__*/

