//=========================================================================
//	
//	スクリプトメイン
//
//	2001.03.28 by tama
//	2001.11.07 by tama
//
//=========================================================================
#ifndef SCRIPT_H
#define SCRIPT_H

#include "common.h"
#include "field.h"
#include "ev_flag.h"	//スクリプト用変数アクセスのため

#undef GLOBAL
#ifdef SCRIPT_H_GLOBAL
#define GLOBAL /*	*/
#else
#define GLOBAL extern
#endif

//=========================================================================
//	定義
//=========================================================================





//#define name value

//typedef ...

//=========================================================================
//	変数
//=========================================================================
//GLOBAL type valiable;

extern const VM_CODE * ReserveScript;

//=========================================================================
//	関数プロトタイプ
//=========================================================================
//GLOBAL type function(arg...);

//--------------------------------------------------------------
//	スクリプト制御初期化
//--------------------------------------------------------------
GLOBAL void InitFieldScript( void );

//--------------------------------------------------------------
//	スクリプト制御メイン
//	<戻り値>
//	TRUE	スクリプト実行中
//	FALSE	スクリプト実行終了
//--------------------------------------------------------------
GLOBAL u8 ControlFieldScript( void );

//--------------------------------------------------------------
//	スクリプト制御スタート
//	<引数>
//	script	スクリプトデータアドレス
//--------------------------------------------------------------
GLOBAL void StartFieldScript(const VM_CODE * script);

//--------------------------------------------------------------
//	スクリプト制御停止
//--------------------------------------------------------------
GLOBAL void StopFieldScript( void );

//--------------------------------------------------------------
//	スクリプト制御再開
//	※StopFieldScriptに対応している
//--------------------------------------------------------------
GLOBAL void ContinueFieldScript( void );

//--------------------------------------------------------------
//	特殊スクリプト実行
//	<引数>
//	script	スクリプトデータアドレス
//--------------------------------------------------------------
GLOBAL void DoSpecialScript( const VM_CODE * script );


//--------------------------------------------------------------
//	強制イベントフラグセット（ほかのイベント起動がフックされる）
//--------------------------------------------------------------
GLOBAL void SetForceEvent( void );

//--------------------------------------------------------------
//	強制イベントフラグ解除
//--------------------------------------------------------------
GLOBAL void ResetForceEvent( void );

//--------------------------------------------------------------
//	強制イベントフラグチェック
//	<戻り値>
//	TRUE	強制イベント中
//	FALSE	強制イベントでない
//--------------------------------------------------------------
GLOBAL u8 CheckForceEvent( void );

//--------------------------------------------------------------
//	マップヘッダデータ処理
//--------------------------------------------------------------
GLOBAL void ObjControlScriptCheck( void );				//	マップ遷移時のOBJ関連制御
GLOBAL void FlagControlScriptCheck( void );				//	マップ遷移時のフラグ制御
GLOBAL void InitControlScriptCheck( void );				// マップ初期化ごとの特殊処理関連
GLOBAL	u8 SceneEventCheck( void );						// シーンでのイベント起動チェック
GLOBAL void LinkControlScriptCheck( void );				// 接続制御の特殊処理（現状ダイビングのみ）
GLOBAL void BgControlScriptCheck( void );

//-------------------------------------------------------------
//	外部スクリプトのセット
//	<引数>	
//			src				外部スクリプトのアドレス
//			size			外部スクリプトのサイズ
//			div_id	map_id	マップ指定
//			obj_id			そのマップでのＯＢＪＩＤ指定
//-------------------------------------------------------------
GLOBAL int SetExScript( const u8 * src, u16 size, u8 div, u8 map, u8 obj );

//-------------------------------------------------------------
//	外部スクリプトのクリア
//-------------------------------------------------------------
GLOBAL void ClearExScript( void );

//-------------------------------------------------------------
//	ＯＢＪに指定した外部スクリプトのチェック
//	<引数>	obj_id		チェックするＯＢＪのＩＤ
//			org_script	通常起動するはずのスクリプトアドレス
//	<戻り値>	起動するスクリプトアドレス
//-------------------------------------------------------------
GLOBAL const VM_CODE * ExScriptObjCheck( u8 obj_id, const VM_CODE * org_script );

#undef GLOBAL
#endif	/*SCRIPT_H*/

