//====================================================================
//							TV企画			01/10/11 nohara
//====================================================================

//--------------------------------------------------------------------
//
//--------------------------------------------------------------------
extern void ChangeTVCell(int,int);	//TVのセルを変える(fieldmap.c)
extern void TVDataAllInit();		//TV,CMデータ初期化


//--------------------------------------------------------------------
//						インタビュー＆カメラマン
//--------------------------------------------------------------------
extern void TVCameraAllInit();
extern void TVCameraBattleDataSet();
extern void TVCameraDataSet();
extern void TVCameraWatchFlagReset();


