//=========================================================================
//
//
//	バージョン定義ソース
//
//
//=========================================================================

#include "common.h"


//=========================================================================
//
//	バージョンチェック
//
//=========================================================================

#if (PM_VERSION == VERSION_SAPPHIRE )
/* サファイアバージョン、問題なし */
#elif (PM_VERSION == VERSION_RUBY )
/* ルビーバージョン、問題なし */
#else
/* 未定義バージョン、問題あり！ */
#error!!
#endif

#if (PM_LANG == LANG_JAPAN )
/* 日本語、問題なし */
#else
/* 未定義の言語、問題あり!　*/
#error!!
#endif

//=========================================================================
//
//	バージョン参照用データ
//
//=========================================================================

const u8 CasetteVersion = PM_VERSION;

const u8 CasetteLanguage = PM_LANG;

#include "d_date.h"		/* 日付文字列：ROM作成 */

